Repository: Jalakas/my-weather-indicator
Catalog: po/*.po
Languages: be, bg, el, eu, gl, hr, lt, lv, ms, pl, ro, si, sk, tr, uk, vi

source: Where Am I
be: Дзе я?
bg: Къде съм аз?
el: Εύρεση τοποθεσίας
eu: Non nago
gl: Onde estou
hr: Gdje se nalazim
lt: Kur aš esu
lv: Kur es esmu
ms: Dimana saya
pl: Gdzie jestem
ro: Unde mă aflu
si: මම කොතැනද
sk: Kde som
tr: Neredeyim?
uk: Моє місце знаходження
vi: Vị trí của tôi

source: Search location
be: Пошук месцазнаходжання
bg: Търсене на местоположение
el: Αναζήτηση
eu: Kokapena bilatu
gl: Buscar localidade
hr: Traži lokaciju
lt: Ieškoti vietovės
lv: Meklēt atrašanās vietu
ms: Cari lokasi
pl: Szukaj lokalizacji
ro: Căutare localitate
si: ස්ථානය සොයන්න
sk: Vyhľadať miesto
tr: Konumu ara
uk: Пошук розташування
vi: Tìm kiếm địa điểm

source: Clear location
be: Дакладнае размяшчэнне
bg: Изчисти местоположението
el: Καθαρισμός
eu: Kokapena garbitu
gl: Borrar localización
hr: Ukloni lokaicju
lt: Išvalyti
lv: Notīrīt atrašanās vietu
ms: Padam lokasi
pl: Zresetuj położenie
ro: Ștergere localitate
si: ස්ථානය මකන්න
sk: Zmazať miesto
tr: Konumu temizle
uk: Очистити розташування
vi: Xóa vị trí

source: Input the name of your city
be: Калі ласка, увядзіце назву вашага горада
bg: Въведете името на града
el: Όνομα πόλης
eu: Zure herriaren izena sartu
gl: Introduza o nome da súa cidade
hr: Upišite naziv vašeg grada
lt: Įvesti savo miesto pavadinimą
lv: Ievadiet, jūsu pilsētas nosaukumu
ms: Masukkan nama bandar anda
pl: Wprowadź nazwę swojego miasta
ro: Introduceți numele orașului dumneavoastră
si: ඔබගේ නගරයේ නම ඇතුලත් කරන්න
sk: Vložte názov vášho mesta
tr: Şehrinizin adını girin
uk: Введіть назву вашого міста
vi: Thành phố bạn đang sống

source: Search
be: Пошук
bg: Търси
el: Αναζήτηση
eu: Bilatu
gl: Buscar
hr: Pretraživanje
lt: Paieška
lv: Meklēt
ms: Cari
pl: Szukaj
ro: Caută
si: සොයන්න
sk: Vyhľadávať
tr: Arama
uk: Пошук
vi: Tìm Kiếm

source: Find me
be: Знайсці мяне
bg: Намери ме
el: Βρες με!
eu: Bila nazazu
gl: Atópame
hr: Potraži me
lt: Rasti mane
lv: Atrodi mani
ms: Cari saya
pl: Znajdź mnie
ro: Găsește-mă
si: මාව සොයන්න
sk: Nájdi mi
tr: Konumumu bul
uk: Знайти мене
vi: Tìm vị trí của tôi

source: City
be: Горад
bg: Град
el: Πόλη
eu: Hiria
gl: Poboación
hr: Grad
lt: Miestas
lv: Pilsēta
ms: Bandar
pl: Miasto
ro: Oraș
si: නගරය
sk: Mesto
tr: Şehir
uk: Місто
vi: Thành phố

source: State
be: Рэгіён
bg: Област
el: Νομός
eu: Estatua
gl: Estado/Provincia
hr: Županija
lt: Rajonas
lv: Štats
ms: Keadaan
pl: Region
ro: Stat
si: ජනපදය
sk: Štát
tr: Durum
uk: Область
vi: Tiểu bang

source: Country
be: Краіна
bg: Държава
el: Χώρα
eu: Herrialdea
gl: País
hr: Država
lt: Šalis
lv: Valsts
ms: Negeri
pl: Kraj
ro: Țară
si: රට
sk: Krajina
tr: Ülke
uk: Країна
vi: Quốc gia

source: Preferences
be: Настройкі
bg: Предпочитания
el: Προτιμήσεις
eu: Hobespenak
gl: Preferencias
hr: Osobitosti
lt: Nustatymai
lv: Uzstādījumi
ms: Pilihan
pl: Preferencje
ro: Preferinţe
si: අභිරුචි
sk: Nastavenia
tr: Tercihler
uk: Налаштування
vi: Tùy chỉnh

source: Main Location
be: Мой горад
bg: Моето местоположение
el: Κύρια τοποθεσία
eu: Kokapen nagusia
gl: Localización principal
hr: Glavna lokacija
lt: Mano vietovė
lv: Galvenā atrašanās vieta
ms: Lokasi utama
pl: Główna lokalizacja
ro: Locația Principală
si: ප්‍රධාන පිහිටීම
sk: Hlavná lokalita
tr: Birincil konum
uk: Основне місцезнаходження
vi: Vị trí Chính

source: General options
be: Агульныя настройкі
bg: Общи настройки
el: Γενικές επιλογές
eu: Aukera orokorrak
gl: Opcións xerais
hr: Opće mogućnosti
lt: Pagrindiniai nustatymai
lv: Vispārīgās iespējas
ms: Pilihan am
pl: Ustawienia ogólne
ro: Opțiuni generale
si: පොදු විකල්ප
sk: Všeobecné nastavenia
tr: Genel seçenekler
uk: Загальні параметри
vi: Các tuỳ chọn chung

source: Auto Location
be: Аўтаматычнае распалажэнне
bg: Автоматично местоположение
el: Αυτόματη Εύρεση Τοποθεσίας
eu: Kokapen automatikoa
gl: Localización automática
hr: Automatska lokacija
lt: Surasti mane
lv: Automātiskā atrašanās vieta
ms: Lokasi (Auto)
pl: Lokalizacja automatyczna
ro: Locație automată
si: ස්වයංක්‍රිය පිහිටීම
sk: Auto lokalizácia
tr: Konumu otomatik bul
uk: Автоматичне визначення положення
vi: Tự động Xác định Vị trí

source: Locality
be: Месцазнаходжанне
bg: Населено място
el: Περιοχή
eu: Herria
gl: Localidade
hr: Lokacija
lt: Vietovė
lv: Apvidus
ms: Tempatan
pl: Położenie
ro: Localitatea
si: ප්‍රදේශය
sk: Lokalita
tr: Konum
uk: Місцевість
vi: Vùng

source: Search Location
be: Знайсці месца
bg: Намери местоположението
el: Αναζήτηση Τοποθεσίας
eu: Kokapena Bilatu
gl: Buscar localidade
hr: Potraži lokaciju
lt: Ieškoti vietovės
lv: Meklēt atrašanās vietu
ms: Lokasi carian
pl: Szukaj lokalizacji
ro: Caută locația
si: පිහිටීම සොයන්න
sk: Hľadať miesto
tr: Konumu ara
uk: Пошук місцезнаходження
vi: Tìm kiếm Vị trí

source: Show temperature
be: Паказваць тэмпературу
bg: Показвай температурата
el: Εμφάνιση θερμοκρασίας
eu: Tenperatura erakutsi
gl: Mostrar a temperatura
hr: Prikaži temperaturu
lt: Rodyti temperatūrą
lv: Rādīt temperatūru
ms: Tatapan suhu
pl: Wyświetlaj temperaturę
ro: Arată temperatura
si: උෂ්ණත්වය පෙන්වන්න
sk: Zobrazovať teplotu
tr: Sıcaklığı göster
uk: Показувати температуру
vi: Hiện nhiệt độ

source: Show notifications
be: Паказваць паведамленні
bg: Показвай известията
el: Εμφάνιση ειδοποιήσεων
eu: Jakinarazpenak erakutsi
gl: Mostrar notificacións
hr: Prikaži obavijesti
lt: Rodyti pranešimus
lv: Rādīt paziņojumus
ms: Papar pemberitahuan
pl: Wyświetlaj powiadomienia
ro: Afișează notificările
si: නිවේදන පෙන්වීම
sk: Zobrazovať upozornenia
tr: Bildirimleri göster
uk: Показувати сповіщення
vi: Hiện các thông báo

source: Show widget
be: Паказваць віджэт
bg: Покажи уиджета
el: Εμφάνιση Widget
eu: Erakutsi widgeta
gl: Mostrar trebello
hr: Prikaži widget
lt: Rodyti skydelį
lv: Rādīt vidžetu
ms: Paparkan widget
pl: Pokaż widżet
ro: Arata Widget
si: widget පෙන්වීම
sk: Zobraziť miniaplikáciu
tr: Uygulamacığı göster
uk: Показати віджет
vi: Hiển thị trên desktop

source: Hide indicator when show widget
be: Схаваць індыкатар, калі адлюстроўваецца віджэт
bg: Скрий индикатора, когато уиджета се показва
el: Απόκρυψη εικονιδίου όταν Widget ενεργό
eu: Ezkutatu indikadorea widgeta erakustean
gl: Ocultar o indicador ao mostrar o trebello
hr: Sakrij indikator kada je widget prikazan
lt: Slėpti rodiklį, kai rodomas skydelis
lv: Slēpt indikātoru kad rāda vidžetu
ms: Sembunyikan penunjuk apabila memaparkan widget
pl: Ukryj indicator gdy wiświeylany widżet
ro: Ascunde indicatorul atunci când se afiseaza Widget-ul
si: Widget පෙන්වීමේදී දර්ශකය සඟවන්න
sk: Skryť ukazovateľ pri zobrazenej miniaplikácii
tr: Uygulamacık açıkken panel göstergesini gizle
uk: Сховати індикатор, коли показується віджет
vi: Ần trên tab khi hiển thị ở desktop

source: Widget on top
be: Віджэт па-над усімі вокнамі
bg: Уиджета най-отгоре
el: Widget στην κορυφή
eu: Widgeta gainean
gl: Trebello enriba
hr: Widget na vrhu
lt: Skydelis viršuje
lv: Vidžets pašā augšā
ms: Widget di atas
pl: Widżet na wierzchu
ro: Widget deasupra
si: Widget ඉහලින්ම පෙන්වන්න
sk: Miniaplikácia navrchu
tr: Uygulamacık tüm pencerelerin üstünde
uk: Віджет завжди зверху
vi: Luôn nổi

source: Show in taskbar
be: Паказаць на панэлі задач
bg: Покажи в лентата със задачите
el: Προβολή στη μπάρα εργασιών
eu: Bistarazi ataza-barran
gl: Mostrar na barra de tarefas
hr: Prikaži u traci zadataka
lt: Rodyti užduočių juostoje
lv: Rādīt uzdevumjoslā
ms: Paparkan dalam palang tugas
pl: Pokazuj na pasku zadań
ro: Arata in taskbar
si: කාර්ය තීරුවේ පෙන්වන්න
sk: Zobraziť v panely úloh
tr: Araç çubuğunda göster
uk: Показувати на панелі задач
vi: Hiện thị trên thanh công cụ

source: Second Location
be: Наступнае месца
bg: Второ местоположение
el: Δεύτερη Τοποθεσία
eu: Bigarren kokapena
gl: Segunda localización
hr: Druga lokacija
lt: Kita vietovė
lv: Otrā atrašanās vieta
ms: Lokasi kedua
pl: Druga lokalizacja
ro: Locație secundară
si: දෙවන පිහිටීම
sk: Druhá lokalita
tr: İkincil konum
uk: Друге місцезнаходження
vi: Vị trí Phụ

source: Weather Services
be: Сэрвісы надвор'я
bg: Метеорологични служби
el: Μετεωρολογικές Υπηρεσίες
eu: Eguraldi zerbitzariak
gl: Servizos meteorolóxicos
hr: Usluge vremena
lt: Orų prognozės centrai
lv: Meteoroloģiskais dienests
ms: Perkhidmatan Cuaca
pl: Serwisy pogodowe
ro: Serviciile Meteo
si: කාලගුණ සේවා
sk: Servis počasia
tr: Bilgi sağlayıcıları
uk: Сервер погоди
vi: Nguồn cấp tin

source: Input World Weather Online key
be: Уваход Сусветнай службы Надвор'я, Інтэрнэт-ключ
bg: Въведете ключа от World Weather Online
el: Εισαγωγή κλειδιού World Weather Online
gl: Clave para World Weather Online
hr: Upišite World Weather Online ključ
lt: Įvesti "World Weather Online" raktažodį
lv: Ievadiet World Weather Online atslēgu
ms: Masukkan kod untuk World Weather Online
pl: Podaj klucz World Weather Online
ro: Introdu cheia pentru World Weather Online
si: ලෝක කාලගුණ සබැඳි යතුර ඇතුලත් කරන්න
sk: Vstupný kľúč World Weather Online
tr: Dünya Hava Durumu Çevrimiçi Anahtarını Girin
uk: Введіть ключ від World Weather Online
vi: Nhập khóa cho World Weather Online

source: Activate
be: Задзейнічаць
bg: Активирай
el: Ενεργοποίηση
gl: Activar
hr: Aktiviraj
lt: Aktyvinti
lv: Aktivizēt
ms: Aktifkan
pl: Aktywacja
ro: Activează
si: සක්‍රීය කරන්න
sk: Aktivovať
tr: Etkinleştir
uk: Активувати
vi: Kích hoạt

source: Click to activate World Weather Online
be: Націсніце, каб актываваць Сусветнай службы Надвор'я Онлайн
bg: Натисни за активиране на World Weather Online
el: Ενεργοποίηση World Weather Online
gl: Prema para activar o World Weather Online
hr: Kliknite za aktivaciju World Weather Online
lt: Spustelėkite, kad aktyvintumėte "World Weather Online"
lv: Noklikšķiniet, lai aktivizētu World Weather Online
ms: Klik untuk mengaktifkan World Weather Online
pl: Kliknij aby aktywować World Weather Online
ro: Apasa pentru a activa World Weather Online
si: ලෝක කාලගුණ සබැඳිය සක්‍රිය කිරීමට ක්ලික් කරන්න
sk: Aktivovať World Weather Online
tr: Dünya Hava Durumu Çevrimiçi'ni etkinleştirmek için tıklayın
uk: Натисніть для активації World Weather Online
vi: Click để kích hoạt

source: Input Weather Underground key
be: вядзіце Weather Underground ключ
bg: Въведете ключа от Weather Underground
el: Εισαγωγή κλειδιού Weather Underground
gl: Clave para Weather Underground
hr: Upišite Weather Underground ključ
lt: Įvesti "Weather Underground" raktažodį
lv: Ievadiet Weather Underground atslēgu
ms: Masukkan kod untuk Weather Underground
pl: Podaj klucz Weather Underground
ro: Introdu cheia pentru Weather Underground
si: භූගත කාලගුණ තොරතුරු යතුර ඇතුලත් කරන්න
sk: Vstupný kľúč Weather Underground
tr: Dünya Yeraltı Anahtarını Girin
uk: Введіть ключ від Weather Underground
vi: Nhập khóa cho Weather Underground

source: Click to activate Weather Underground
be: Націсніце, каб актываваць Weather Underground
bg: Натисни за активиране на Weather Underground
el: Ενεργοποίηση Weather Underground
gl: Prema para activar Weather Underground
hr: Kliknite za aktivaciju Weather Underground
lt: Spustelėkite, kad aktyvintumėte "Weather Underground"
lv: Noklikšķiniet, lai aktivizētu Weather Underground
ms: Klik untuk mengaktifkan Weather Underground
pl: Kliknij aby aktywować Weather Underground
ro: Apasa pentru a activa Weather Underground
si: භූගත කාලගුණ සබැඳිය සක්‍රිය කිරීමට ක්ලික් කරන්න
sk: Aktivovať Weather Underground
tr: Dünya Yeraltı'nı etkinleştirmek için tıklayın
uk: Натисніть для активації Weather Underground
vi: Click để kích hoạt

source: Units
be: Адзінкі вымярэння
bg: Мерни единици
el: Μονάδες μέτρησης
eu: Unitateak
gl: Unidades
hr: Mjerne jedinice
lt: Matavimo vienetai
lv: Mērvienības
ms: Unit
pl: Jednostki
ro: Unități
si: ඒකක
sk: Jednotky
tr: Birimler
uk: Одиниці
vi: Các đơn vị

source: Temperature
be: Тэмпература
bg: Температура
el: Θερμοκρασία
eu: Tenperatura
gl: Temperatura
hr: Temperatura
lt: Temperatūra
lv: Temperatūra
ms: Suhu
pl: Temperatura
ro: Temperatură
si: උෂ්ණත්වය
sk: Teplota
tr: Sıcaklık
uk: Температура
vi: Nhiệt độ

source: Celsius
be: па Цэльсію
bg: Целзий
el: Κελσίου
gl: Centígrados
hr: Celzijus
lt: Pagal Celsijų
lv: Celsija grādi
ms: Selsius
pl: Celsjusza
si: සෙල්සියස්
sk: Celzia
tr: Santigrat
uk: за Цельсієм
vi: Độ C

source: Fahrenheit
be: па Фарэнгейту
bg: Фаренхайт
el: Φαρενάιτ
hr: Farenhajt
lt: Pagal Farenheitą
lv: Fārenheita grādi
ms: Fahrenhait
pl: Fahrenheita
si: ෆැරන්හයිට්
sk: Fahrenheita
tr: Fahrenhayt
uk: за Фаренгейтом
vi: Độ F

source: Kelvin
be: па Кельвіну
bg: Келвин
el: Κέλβιν
lt: Pagal Kelviną
lv: Kelvina grādi
pl: Kelwina
si: කෙල්වින්
sk: Kelvina
uk: за Кельвіном
vi: Độ K

source: Pressure
be: Атмасферны ціск
bg: Налягане
el: Ατμοσφαιρική πίεση
eu: Presioa
gl: Presión
hr: Tlak
lt: Slėgis
lv: Spiediens
ms: Tekanan
pl: Ciśnienie
ro: Presiune
si: පීඩණය
sk: Tlak
tr: Basınç
uk: Тиск
vi: Áp suất

source: Millibar
be: мілібар
bg: Милибара
el: χιλιοστά bar
eu: Milibar
gl: Milibares
lt: Milibarai
lv: Milibāri
pl: milibar
ro: Milibari
si: මිලිබාර්
sk: Milibar
uk: мілібар

source: Inches of mercury
be: цаля рт. сл.
bg: Инча живачен стълб
el: Ίντσες στήλης Υδραργύρου
eu: Merkuri hatzbete
gl: Polgadas de mercurio
hr: Inči žive
lt: Coliai gyvsidabrio stulpelyje
lv: Collas dzīvsudraba staba
ms: Takat raksa (Inci)
pl: Cali słupka rtęci
ro: Inchi coloana de mercur
si: රසදිය අඟල්
sk: Výška teploty
tr: inçHg
uk: дюймів ртутного стовпчика
vi: Inch thủy ngân

source: Millimeters of mercury
be: мм рт.сл.
bg: Милиметра живачен стълб
el: Χιλιοστά στήλης Υδραργύρου
eu: Merkurio milimetro
gl: Milímetros de mercurio
hr: Milimetri žive
lt: Milimetrai gyvsidabrio stulpelyje
lv: Milimetri dzīvsudraba staba
ms: Takat raksa (Milimeter)
pl: Milimetrów słupka rtęci
ro: Milimetri coloana de mercur
si: රසදිය මිලිමීටර්
sk: Milimetrov na teplomeri
tr: mmHg
uk: міліметрів ртутного стовпчика
vi: Milimet thủy ngân

source: Visibility
be: Бачнасць
bg: Видимост
el: Ορατότητα
eu: Ikuspena
gl: Visibilidade
hr: Vidljivost
lt: Matomumas
lv: Redzamība
ms: Jarak penglihatan
pl: Widzialność
ro: Vizibilitate
si: දෘෂ්‍යතාවය
sk: Viditeľnosť
tr: Görünürlük
uk: Видимість
vi: Tầm nhìn

source: mile
be: міля
bg: миля
el: μίλι
eu: milia
gl: milla
hr: milja
lt: Mylia
lv: Jūdze
ms: batu
pl: mila
ro: milă
si: සැතපුම
sk: míľa
tr: mil
uk: миля
vi: dặm

source: kilometer
be: кіламетр
bg: километър
el: χιλιόμετρο
eu: kilometro
gl: quilómetro
hr: kilometar
lt: Kilometras
lv: Kilometrs
pl: kilometr
ro: kilometru
si: කිලෝ මීටර
tr: kilometre
uk: кілометр
vi: ki lô mét

source: Wind velocity
be: Хуткасць ветру
bg: Скорост на вятъра
el: Ταχύτητα ανέμου
eu: Haizearen abiadura
gl: Velocidade do vento
hr: Brzina vjetra
lt: Vėjo greitis
lv: Vēja ātrums
ms: Kelajuan angin
pl: Prędkość wiatru
ro: Viteza vântului
si: සුළඟේ ප්‍රවේගය
sk: Rýchlosť vetra
tr: Rüzgar hızı
uk: Швидкість вітру
vi: Vận tốc gió

source: Beaufort
be: па Бофарту
bg: Бофорт
el: Μποφόρ
lt: Boforto
lv: Boforta
pl: Skala Beauforta
si: බියුෆෝර්ට්
sk: Beauforta
tr: Rüzgar çizelgesi
uk: бали Бюфорта
vi: Cấp gió

source: ft/s
be: фут/с
bg: фута/сек
el: πόδια/δευτερόλεπτο
gl: pé/s
lv: Pēdas sekundē (ft/s)
ms: kaki/s
ro: picioare/s
si: තත්පරයට අඩි
uk: фут/с

source: km/h
be: км/г
bg: км/ч
el: χλμ/ώρα
eu: km/o
lv: Kilometri stundā (km/h)
ms: km/j
si: පැයට කිලෝ මීටර
tr: km/sa
uk: км/год

source: knots
be: вузлы
bg: възли
el: κόμβοι
eu: korapiloak
gl: nós
hr: čvorova
lt: mazgai
lv: Mezgli
ms: knot
pl: węzły
ro: noduri
sk: uzlov
tr: deniz mili
uk: вузлів

source: m/s
be: м/с
bg: м/сек
el: μέτρα/δευτερόλεπτο
lt: m/sek.
lv: Metri sekundē (m/s)
si: තත්පරයට මීටර
uk: м/с

source: mph
be: міль/г
bg: мили/ч
el: μ/ώρα
eu: m/o
lv: Jūdzes stundā (mph)
ms: bsj
pl: mile/h
ro: mile/h
si: පැයට මීටර
sk: míľ/h
tr: mil/sa
uk: миль/год
vi: mi/h

source: Rain Gauge
be: Ападкі (дождж)
bg: Ниво на валеж
el: Δείκτης βροχόπτωσης
eu: Euri neurria
gl: Precipitación
hr: Količina kišnih padalina
lt: Lietaus matuoklis
lv: Lietus mērītājs
ms: Tolok Hujan
pl: Szacowany opad deszczu
ro: Pluviometru
si: වර්ෂාපතනය
sk: Odhad zrážok
tr: Yağmur ölçeği
uk: Опади (дощ)
vi: Lượng mưa

source: Inches
be: цалі
bg: Инча
el: Ίντσες
eu: Hazbeteak
gl: Polgadas
hr: Inča
lt: Coliai
lv: Collas
ms: Inci
pl: Cale
ro: Inchi
si: අඟල්
sk: Výška
tr: İnç
uk: Дюймів
vi: Inch

source: Centimeters
be: сантыметры
bg: Сантиметра
el: Εκατοστά
eu: Zentimetroak
gl: Centímetros
hr: Centimetara
lt: Centimetrai
lv: Centimetri
ms: Sentimeter
pl: Centymetry
ro: Centimetri
si: සෙන්ටිමීටර
sk: Centimetre
tr: Santimetre
uk: Сантиметрів
vi: Centimet

source: Millimeters
be: міліметры
bg: Милиметра
el: Χιλιοστά
eu: Milimetroak
gl: Milímetros
hr: Milimetara
lt: Milimetrai
lv: Milimetri
ms: Milimeter
pl: Milimetry
ro: Milimetri
si: මිලිමීටර
sk: Milimetre
tr: Milimetre
uk: Міліметрів
vi: Milimet

source: Snow Gauge
be: Ападкі (снег)
bg: Ниво на снеговалеж
el: Δείκτης χιονόπτωσης
eu: Elur neurria
gl: Neve
hr: Količina snježnih padalina
lt: Sniego matuoklis
lv: Sniega mērītājs
ms: Tolok Salji
pl: Szacowany opad śniegu
ro: Polei
si: හිමපතනය
sk: Odhad snehu
tr: Kar ölçeği
uk: Опади (сніг)
vi: Tuyết rơi

source: Time Format
be: Фармат часу
bg: Формат на времето
el: Μορφή ώρας
eu: Orduaren formatua
gl: Formato da hora
hr: Format vremena
lt: Laiko formatas
lv: Laika formāts
ms: Format Masa
pl: Format czasu
ro: Format oră
si: කාල ආකෘතිය
sk: Formát času
tr: Saat Biçimi
uk: Формат часу
vi: Định dạng Thời gian

source: 24 h
be: 24-гадзінны
bg: 24 часа
el: 24ωρη
eu: 24 o
lt: 24 valandos
ms: 24 J
pl: 24 godziny
si: පැය 24
sk: 24 hodinový
tr: 24 saat biçimi
uk: 24 г.

source: AM/PM
be: 12-гадзінны
el: πμ/μμ
lt: 12 valandų (AM/PM)
si: පෙ.ව/ප.ව
tr: 12 saat biçimi
vi: SA/CH

source: Autostart
be: Аўтазапуск
bg: Автоматично стартиране
el: Αυτόματη Εκκίνηση
eu: Autoabiarazi
gl: Inicio automático
hr: Automatsko pokretanje
lt: Automatinis pasileidimas
lv: Sākt automātiski
ms: Auto-mula
pl: Uruchamiaj automatycznie
ro: Pornire automată
si: ස්වයංක්‍රීය ඇරඹුම
sk: Pri spustení
tr: Başlangıç uygulamalarına ekle
uk: Автозапуск
vi: Tự khởi động

source: Refresh frequency
be: Частата абнаўлення
bg: Честота на обновяване
el: Συχνότητα ανανέωσης
eu: Berritze-maiztasuna
gl: Frecuencia da actualización
hr: Učestalost osvježavanja
lt: Atnaujinimo dažnis
lv: Atsvaidzināšanas frekvence
ms: Kemaskini semula frekuensi
pl: Częstotliwość aktualizacji
ro: Frecvența de actualizare
si: යාවත්කාල කිරීමේ වාරගණන
sk: Obnoviť opakovanie
tr: Şu sıklıkla güncelle:
uk: Частота оновлення
vi: Tần suất làm mới

source: minutes
be: хвілін
bg: минути
el: λεπτά
gl: minutos
hr: minuta
lt: min.
lv: minūtes
ms: minit
pl: minut/y
ro: minute
si: මිනිත්තු
sk: minúty
tr: dakîka
uk: хв
vi: phút

source: hour
be: гадзіна
bg: час
el: ώρα
gl: hora
hr: sat
lt: val.
lv: stunda
ms: jam
pl: godzina
ro: oră
si: පැයක්
sk: hodina
tr: saat
uk: год.
vi: giờ

source: hours
be: гадзін
bg: часа
el: ώρες
gl: horas
hr: sata(i)
lt: val.
lv: stundas
ms: jam
pl: godziny
ro: ore
si: පැය
sk: hodiny
tr: saat
uk: годин(и)
vi: giờ

source: Select icon theme
be: Абярыце тэму значкоў
bg: Избери тема на иконите
el: Επιλογή θέματος εικονιδίων
eu: Aukeratu ikonoen gaia
gl: Seleccionar tema de iconas
hr: Odaberite temu ikone
lt: Pasirinkite ikonėlių temą
lv: Izvēlēties tēmas ikonu
ms: Pilih tema ikon
pl: Wybierz styl ikony
ro: Selectați tema de pictograme
si: සංකේත තේමාව තෝරන්න
sk: Nastaviť vzhľad ikony
tr: Simge temasını seçin
uk: Оберіть вигляд значка
vi: Chọn chủ đề biểu tượng

source: Updated now
el: Μόλις ενημερώθηκε
gl: actualizado agora
ms: Dikemaskini sekarang
pl: Zaktualizowano przed chwilą
ro: Actualizează

source: Updated: 1 min ago
el: Ενημερώθηκε: 1 λεπτό πριν
gl: actualizado: hai un minuto
ms: Dikemaskini pada: 1 minit lalu
pl: Zaktualizowano: 1 min temu
ro: Actualizat: Acum 1 minut

source: Updated: %s mins ago
el: Ενημερώθηκε: %s λεπτά πριν
gl: actualizado: hai %s mins
ms: Dikemaskini pada: %s minit lalu
pl: Zaktualizowano: %s min temu
ro: Actualizat: Acum %s minute

source: Refresh weather
el: Ανανέωση καιρού
gl: Actualizar tempo
ms: Kemaskini ramalan cuaca
pl: Odśwież pogodę
ro: Actualizează vremea

source: In Launchpad
el: Στο Launchpad
gl: En Launchpad
ms: Dalam Launchpad
pl: Na Launchpadzie
ro: In Bara de lansare

source: Get help online...
be: Дапамога онлайн...
bg: Получи помощ онлайн...
el: Διαδικτυακή βοήθεια
eu: Jaso online laguntza...
gl: Obter axuda na rede...
hr: Online pomoć...
lt: Pagalba internete
lv: Iegūt palīdzību tiešsaistē...
ms: Dapatkan bantuan atas talian...
pl: Uzyskaj pomoc w sieci...
ro: Obțineți ajutor on-line...
si: අන්තර්ජාලයේ උදව් ලබා ගැනීම...
sk: Online pomoc...
tr: Çevrimiçi yardım alın...
uk: Допомога онлайн…
vi: Nhận trợ giúp trực tuyến...

source: Translate this application...
be: Пераклад гэтага прыкладання...
bg: Преведи това приложение...
el: Μετάφρασε την εφαρμογή...
eu: Itzuli aplikazioa hau...
gl: Traducir este aplicativo...
hr: Prevedi aplikaciju...
lt: Versti šią programą...
lv: Iztulkot šo programmu...
ms: Terjemah aplikasi ini...
pl: Przetłumacz tę aplikację...
ro: Traduceți aplicația...
si: මෙම යෙදුම පරිවර්තනය කරන්න...
sk: Preložiť túto aplikáciu...
tr: Bu uygulamanın çevirisini yapın...
uk: Запропонувати переклад…
vi: Dịch ứng dụng này...

source: Report a bug...
be: Паведаміць аб памылке...
bg: Докладвай за грешка...
el: Δήλωσε δυσλειτουργία...
eu: Arazoen berri eman...
gl: Informar dun fallo...
hr: Prijavi grešku...
lt: Pranešti apie klaidą...
lv: Ziņot par problēmu
ms: Laporkan pepijat...
pl: Zgłoś błąd...
ro: Raportați o problemă...
si: දෝෂයක් වාර්තා කරන්න...
sk: Nahlásiť chybu...
tr: Bir hata bildir....
uk: Повідомити про помилку…
vi: Báo cáo một lỗi...

source: Homepage
be: Старонка праэкта
bg: Домашна страница
el: Ιστοσελίδα
eu: Lehen-orria
gl: Páxina web
hr: Web stranica
lt: Tinklalapis
lv: Mājas lapa
ms: Laman utama
pl: Strona domowa
ro: Pagina de start
si: නිවෙස් පිටුව
sk: Domovská stránka
tr: Ana Sayfa
uk: Домівка
vi: Trang chủ

source: Follow us in Twitter
el: Ακολουθήστε μας στο Twitter
gl: Síganos no Twitter
ms: Ikuti kami di laman Twitter
pl: Obserwuj nas na Twitterze
ro: Dati-ne un Follow pe Twitter

source: Follow us in Google+
el: Ακολουθήστε μας στο Google+
gl: Síganos no Google+
pl: Obserwuj nas w Google+
ro: Urmăriţi-ne pe Google+

source: Follow us in Facebook
el: Ακολουθήστε μας στο Facebook
gl: Síganos no Facebook
ms: Ikuti kami di laman Facebook
pl: Obserwuj nas na Facebooku
ro: Urmăriţi-ne pe Facebook

source: About
be: Аб праграме
bg: Относно програмата
el: Περί
eu: Honi buruz
gl: Sobre
hr: O programu
lt: Apie
lv: Par
ms: Perihal
pl: O programie
ro: Despre
si: පිළිබඳව
sk: O programe
tr: Hakkında
uk: Про програму…
vi: Giới thiệu

source: Forecast
be: Прагноз надвор'я
bg: Прогноза за времето
el: Πρόγνωση καιρού
eu: Iragarpena
gl: Prognóstico
hr: Vremenska prognoza
lt: Orų prognozė
lv: Prognoze
ms: Ramalan
pl: Prognoza
ro: Prognoză
si: අනාවැකිය
sk: Predpoveď
tr: Hava tahmini
uk: Прогноз
vi: Dự báo

source: Forecast Map
be: Надвор'е на карце
bg: Метереологична карта
el: Χάρτης Πρόγνωσης
eu: Iragarpen mapa
gl: Mapa do prognóstico
hr: Prognostička karta
lt: Prognozės žemėlapis
lv: Meteoroloģiskā karte
ms: Peta ramalan cuaca
pl: Mapa pogodowa
ro: Prognoza pe Harta
si: අනාවැකි සිතියම
sk: Mapa s počasím
tr: Hava tahmin haritası
uk: Прогноз на мапі
vi: Bản đồ dự báo

source: Last Update
el: Τελευταία Ενημέρωση
gl: Última actualización
ms: Kemaskini Terakhir
pl: Ostatnia aktualizacja
ro: Ultima actualizare

source: Location
be: Месцазнаходжанне
bg: Местоположение
el: Τοποθεσία
eu: Kokapena
gl: Localización
hr: Lokacija
lt: Vietovė
lv: Atrašanās Vieta
ms: Lokasi
pl: Lokalizacja
ro: Locație
si: පිහිටීම
sk: Miesto
tr: Konum
uk: Місцезнаходження
vi: Vị trí

source: Humidity
be: Вільготнасць
bg: Влажност
el: Υγρασία
eu: Hezetasuna
gl: Humidade
hr: Vlažnost
lt: Drėgmė
lv: Mitrums
ms: Kelembapan
pl: Wilgotność
ro: Umiditate
si: ආර්ද්‍රතාවය
sk: Vlhkosť
tr: Nem oranı
uk: Вологість
vi: Độ ẩm
