Repository: Jalakas/my-weather-indicator
Catalog: po/*.po
Languages: be, bg, el, eu, gl, hr, lt, lv, ms, pl, ro, si, sk, tr, uk, vi

source: Heavy snow
be: Моцны снег
bg: Силен снеговалеж
el: Έντονη χιονόπτωση
eu: Elur-jasa
gl: Nevadas fortes
hr: Jak snijeg
lt: Smarkus sniegas
lv: Spēcīgs sniegs
ms: Salji lebat
pl: Silny śnieg
ro: Ninsoare abundentă
si: තද හිම
sk: Husté sneženie
tr: Ağır kar yağışı
uk: Сильний сніг
vi: Tuyết nhiều

source: Heavy thunderstorm
be: Моцная навальніца
bg: Силна буря
el: Ισχυρή θύελλα
eu: Trumoi-ekaitz handia
gl: Tormenta eléctrica forte
hr: Jaka grmljavinska oluja
lt: Stipri audra
lv: Spēcīgs pērkona negaiss
ms: Ribut petir kuat
pl: Silna burza
ro: Furtună cu descărcări electrice
si: අධික අකුණු ධාරා සහිත
sk: Silné búrky
tr: Şiddetli fırtına
uk: Сильні грози
vi: Bão to

source: Hot
be: Спякота
bg: Горещо
el: Θερμός
eu: Beroa
gl: Quente
hr: Vruće
lt: Karštis
lv: Karsts
ms: Panas
pl: Gorąco
ro: Caniculă
si: උණුසුම්
sk: Horúco
tr: Sıcak
uk: Спека
vi: Nóng

source: Hurricane
be: Ураган
bg: Ураган
el: Τυφώνας
eu: Urakana
gl: Furacán
hr: Uragan
lt: Uraganas
lv: Viesuļvētra
ms: Ribut Taufan
pl: Huragan
ro: Uragan
si: සැඩ කුණාටුව
sk: Orkán
tr: Kasırga
uk: Ураган
vi: Gió bão cực mạnh

source: Ice crystals
be: Крышталі лёду
bg: Ледени кристали
el: Κρύσταλλοι πάγου
eu: Izotz-plakak
gl: Cristais de xeo
hr: Mraz
lt: Ledo kristalai
lv: Ledus kristāli
ms: Kristal ais
pl: Kryształy lodu
ro: Cristale de gheață
si: අයිස් කැට
sk: Námrazy
tr: Buzlu
uk: Льодові кристали
vi: Hạt băng

source: Ice pellet showers
be: Лівень з градам
bg: Дъжд и лед
el: Χαλάζι με βροχή
eu: izotz-pikorta jasa
gl: Sarabia
hr: Pljuskovi sa sitnijom tučom
lt: Ledo gabalėlių liūtis
lv: Krusas lietus
ms: Hujan ais
pl: Gradobicie
ro: Ninsori scurte
si: අයිස් කැට වර්ෂා
sk: Prehánky s ľadovými krúpami
tr: karlı
uk: Крижана крупа
vi: Mưa đá

source: Ice pellets
be: Град
bg: Ледени топки
el: Χαλάζι
eu: Izotz-pikortak
gl: Sarabia
hr: Sitnija tuča
lt: Ledo gabalėliai
lv: Ledus granulas
ms: Hujan ais
pl: Grad
ro: Ploaie înghețată
si: අයිස් කැට
sk: Ľadové krúpi
tr: Karlı
uk: Крупа
vi: Mưa đá

source: Icy
be: Галалёдзіца
bg: Заледено
el: Παγωμένος
eu: Izotza
gl: Xeo
hr: Poledica
lt: Ledinis
lv: Apledojis
ms: Berais
pl: Lodowato
ro: Îngheţat
si: අධික ශිත
sk: Poľadovica
tr: Buzlu
uk: Ожеледиця
vi: Có băng

source: Intensity drizzle
be: Імгла
bg: Интензивна поледица
el: Έντονο ψιχάλισμα
eu: Zirimiria
gl: Orballo intenso
hr: Obilnija sitna kišica
lt: Intensyvi dulksna
lv: Intensīvi smidzina
pl: Intensywna mżawka
ro: Burniță abundentă
si: වේගවත් හිරි පොද
sk: Husté mrholenie
tr: Yoğun çiseleme
uk: Сильна мряка
vi: Mưa phùn

source: Intensity drizzle rain
be: Інтэнсіўна імжлівы дождж
bg: Силно ръмене
el: Έντονο ψιλόβροχο
eu: Zirimiria
gl: Chuviñada intensa
hr: Obilnija sitna kišica
lt: Intensyvus smulkus lietus
lv: Intensīvi smidzinošs lietus
ms: Keamatan hujan gerimis
pl: Intensywny deszcz
ro: Burniță intensă
si: වේගවත් හිරි පොද වැස්ස
sk: Intenzívne mrholenie
tr: Yoğun yağmur çiselemeleri
uk: Сильна мряка
vi: Mưa phùn lớn

source: Intensity rain
be: Інтэнсіўнасць дажджу
bg: Силен дъжд
el: Έντονη βροχόπτωση
gl: Choiva intensa
hr: Obilnija kiša
lt: Lietus
lv: Intensīvs lietus
ms: Keamatan hujan
pl: Intensywny deszcz
ro: Ploaie intensă
si: වේගවත් වැස්ස
sk: Intenzívny dážď
tr: Yoğun yağmur
uk: Сильний дощ
vi: Mưa lớn

source: Isolated showers
be: Кароткачасовыя дажджы
bg: Частични превалявания
el: Τοπικές Μπόρες
eu: Euria tarteka
gl: Chuvascos illados
hr: Mjestimični pljuskovi
lt: Trumpalaikės liūtys
lv: Vietām īslaicīgs lietus
ms: Hujan setempat
pl: Przelotne opady deszczu
ro: Averse izolate
si: කඩින් කඩ වැසි
sk: Miestami prehánky
tr: Sağanak yağmurlu
uk: Подекуди зливи
vi: Có mưa đơn độc

source: Isolated thunderstorms
be: Месцамі навальніцы
bg: Частични гръмотевични бури
el: Τοπικές καταιγίδες
eu: Trumoi-ekaitzak tarteka
gl: Tormentas eléctricas illadas
hr: Mjestimična grmljavinska oluja
lt: Trumpalaikė perkūnija
lv: Vietām pērkona negaiss
ms: Ribut petir setempat
pl: Przelotne burze z piorunami
ro: Furtuni izolate
si: කඩින් කඩ අකුණු
sk: Miestami búrky
tr: Gökgürültülü sağanak yağışlı
uk: Подекуди грози
vi: Có dông đơn độc

source: Light drizzle
be: Дробны дождж
bg: Лек дъжд
el: Ελαφρύ ψιχάλισμα
eu: Zirimiri arina
gl: Orballo
hr: Slaba rosulja
lt: Silpna dulksna
lv: Viegli smidzina
ms: Renyai ringan
pl: Słaba mżawka
ro: Burniță ușoară
si: මද පොද වැස්ස
sk: Slabé mrholenie
tr: Hafif yağmur
uk: Легка мряка
vi: Mưa phùn nhẹ

source: Light freezing rain
be: Невялікі дождж са снегам
bg: Леко заскрежаване
el: Ελαφρύ χιονόβροχο
eu: Euri arina
gl: Choiva xeada débil
hr: Slabija ledena kiša
lt: Silpna lijundra
lv: Viegla sasalstošs lietus
ms: Hujan ringan
pl: Słaby, marznący deszcz
ro: Averse reci
si: මද හිමයන වර්ෂා
sk: Slabý mrznúci dážď
tr: Karla karışık yağmur
uk: Невеликий дощ зі снігом
vi: Mưa nhỏ, rét

source: Light intensity drizzle
be: Невялікая імжа
bg: Слаба поледица
el: Ελαφρύ ψιχάλισμα
eu: Zirimiri arina
gl: Orballo débil
hr: Slaba rosulja
lt: Mažo intensyvumo dulksna
lv: Viegli intensīvi smidzina
ms: Keamatan hujan ringan
pl: Lekka mżawka
ro: Burniță ușoară
si: මද වේගවත් හිරි පොද
sk: Občasné mrholenie
tr: Yoğun yağmur çiselemesi
uk: Помірна мряка
vi: Mưa phùn, nhẹ

source: Light intensity drizzle rain
be: Слаба імжлівы дождж
bg: Слаба поледица с дъжд
el: Ελαφρύ ψιλόβροχο
eu: Zirimiri arina
gl: Chuviñada debil
hr: Slabija sitna kišica
lt: Mažo intensyvumo dulksna - lietus
lv: Viegls intevsīvs smidzinošs lietus
pl: Mżawka
ro: Burniță de intensitate mică
si: මද වේගවත් හිරි පොද වැස්ස
sk: Slabé mrholenie
tr: Yoğun yağmur çiselemesi
uk: Помірна мряка з дощем
vi: Mưa phùn, nhẹ

source: Light intensity shower rain
be: Умераны дождж
bg: Дъжд със слаба интензивност
el: Ασθενής καταιγίδα
eu: Zaparrada arina
gl: Choivas débiles
hr: Slabiji pljusak
lt: Mažo intensyvumo liūtis
lv: Viegls intensīvs īslaicīgs lietus
pl: Kapuśniaczek
ro: Averse reduse ca intensitate
si: මද වේගවත් වැස්ස
sk: Slabý dážď
tr: Yoğun sağanak yağmur
uk: Помірні зливи
vi: Mưa phùn cường độ nhẹ

source: Light rain shower
be: Невялікі дождж
bg: Кратък дъжд
el: Ασθενείς καταιγίδες
eu: Zaparrada arina
gl: Choiva débil
hr: Slabiji pljusak
lt: Maža liūtis
lv: Viegls īslaicīgs lietus
ms: Hujan renyai-renyai
pl: Słaby, przelotny deszcz
ro: Ploaie ușoară
si: මද වර්ෂාව
sk: Slabé prehánky
tr: Hafif sağanak yağmur
uk: Невеликі зливи
vi: Mưa nhỏ

source: Light rain
be: Слабы дождж
bg: Лек дъжд
el: Ελαφριά βροχή
eu: Euri arina
gl: Choiva lixeira
hr: Slaba kiša
lt: Silpnas lietus
lv: Viegls lietus
ms: Hujan renyai
pl: Słaby deszcz
ro: Ploaie ușoară
si: මද වැස්ස
sk: Slabý dážď
tr: Hafif yağmur
uk: Невеликий дощ
vi: Mưa nhẹ

source: Light showers of ice pellets
be: Слабы дождж з градам
bg: Ситни ледени кристали
el: Ελαφρύ χαλάζι
eu: Izotz-pikorta arina
gl: Sarabiadas débiles
hr: Slabiji pljuskovi sa sitnijom tučom
lt: Lengva ledo gabalėlių liūtis
lv: Viegls īslaicīgs lietus no ledus granulām
ms: Hujan batu sederhana
pl: Słabe, przelotne ziarna lodowe lub deszcz lodowy
ro: Averse de ploaie înghețată
si: මද අයිස් කැට වර්ෂාව
sk: Ľahké prehánky s krúpami
tr: Karla karışık yağmur
uk: Невелика крупа
vi: Mưa đá nhỏ

source: Light sleet showers
be: Слабы мокры снег
bg: Слаба суграшица и дъжд
el: Ελαφρύ χιονόνερο
eu: Elurbusti arina
gl: Caída suave de auganeve
hr: Slabija gusta susnježica
lt: Šlapdriba
lv: Viegls īslaicīgs lietus ar sniegu
ms: Hujan air sederhana
pl: Słaby, przelotny deszcz ze śniegiem
ro: Lapoviță ușoară
si: තුෂාර සහිත මද වර්ෂාව
sk: Prehánky slabý dážď so snehom
tr: Hafif suslu kar geçişleri
uk: Невеликий дощ зі снігом
vi: Tuyết rơi nhẹ

source: Light sleet
be: Лёгкі мокры снег
bg: Слаба суграшица
el: Ελαφρύ χιονόνερο
eu: Elurbusti arina
gl: Auganeve suave
hr: Slabija susnježica
lt: Silpna šlapdriba
lv: Viegls lietus ar sniegu
ms: Hujan ais
pl: Słaby deszcz ze śniegiem
ro: Lapoviță ușoară
si: මද තුෂාර
sk: Jemný dážď so snehom
tr: Hafif suslu kar
uk: Мокрий сніг
vi: Có tuyết

source: Light snow showers
be: Невялікі снегапад
bg: Леки снежни превалявания
el: Ασθενής χιονόπτωση
eu: Elur zaparrada arinak
gl: Nevaradas débiles
hr: Slabiji gusti snijeg
lt: Protarpiais pasnigs
lv: Viegla īslaicīga snigšana
ms: Hujan lari salji renyai
pl: Słaby, przelotny śnieg
ro: Ninsoare ușoară în averse
si: මද හිම වර්ෂාව
sk: Slabé snehové prehánky
tr: Hafif kar yağışı
uk: Невеликий снігопад
vi: Tuyết rào nhẹ

source: Light snow
be: Невялікі снег
bg: Лек снеговалеж
el: Ελαφρά χιονόπτωση
eu: Elur arina
gl: Neve lixeira
hr: Slab snijeg
lt: Nedidelis sniegas
lv: Viegla snigšana
ms: Salji ringan
pl: Słaby śnieg
ro: Ninsoare ușoară
si: මඳ හිම
sk: Slabé sneženie
tr: Hafif kar yağışı
uk: Невеликий сніг
vi: Tuyết nhẹ

source: Light thunderstorm
be: Слабая навальніца
bg: Слаба буря
el: Ελαφριά καταιγίδα με κεραυνούς
eu: Trumoi-ekaiz arina
gl: Tormenta eléctrica débil
hr: Slabije grmljavinsko nevrijeme
lt: Nedidelė audra
lv: Viegls pērkona negaiss
pl: Słaba burza
ro: Furtuni ușoare
si: මඳ අකුණු
sk: Slabé búrky
tr: Hafif sağanak
uk: Невеликі грози
vi: Bão nhỏ

source: Low drifting sand
be: Пясчаны нанос
bg: Леко опесъчен
el: Ελαφριά αμμοθύελλα
eu: Harea-bisuts arina
gl: Amoreamento de area
hr: Pijesak nošen slabijim vjetrom
lt: Smėlio Pūga
lv: Vieglas smilšu brāzmas
ms: Takat pasir rendah
pl: Burza piaskowa
ro: Puțin nisip purtat de vânt
si: මඳ වැලි සුළං
sk: Malé piesočné búrky
tr: Kum fırtınalı
uk: Піщаний вітер при землі
vi: Bão cát nhỏ

source: Low drifting snow
be: Замець
bg: Леко натрупал сняг
el: Ελαφριά χιονοθύελλα
eu: Harea-bisuts arina
gl: Amoreamento de neve
hr: Snijeg nošen slabijim vjetrom
lt: Sniego pūga
lv: Vieglas sniega brāzmas
ms: Takat salji rendah
pl: Zamiecie i zawieje
ro: Ninsoare slabă purtată de vânt
si: මඳ හිම සුළං
sk: Malé snežné búrky
tr: Karlı
uk: Поземка
vi: Bão tuyết nhỏ

source: Mist
be: Туман
bg: Мъгла
el: Ομίχλη
eu: Lanbroa
gl: Brétema
hr: Izmaglica
lt: Migla
lv: Migla
ms: Kabus
pl: Mgła
ro: Pâclă
si: මීදුම
sk: Zahmlenie
tr: Hafif sisli
uk: Імла
vi: Sương mù

source: Mixed rain and snow
be: Снег з дажджом
bg: Дъжд и сняг
el: Βροχή και χιόνι
eu: Euria eta elurra
gl: Choiva e neve
hr: Pomiješana kiša i led
lt: Šlapdriba (lietus ir sniegas)
lv: Lietus ar sniegu
ms: Hujan dan salji
pl: Deszcz ze śniegiem
ro: Ploaie și ninsoare amestecate
si: හිම සහිත වර්ෂා
sk: Dážď so snehom
tr: Karla karışık yağmur
uk: Сльота
vi: Mưa và tuyết

source: Mixed rain and sleet
be: Мокры снег з дажджом
bg: Дъжд и суграшица
el: Βροχή και χιονόνερο
eu: Euria eta elurbusti nahastuta
gl: Choiva e sarabia
hr: Miješana kiša i susnježica
lt: Lietus bei šlapdriba
lv: Lietus ar sniegu
ms: Hujan dan hujan ais
pl: Deszcz ze śniegiem
ro: Ploaie și lapoviță amestecate
si: තුෂාර සහිත වර්ෂා
sk: Dážď so snehom
tr: Yağmur ve sulu kar
uk: Дощ та мокрий сніг
vi: Mưa và mưa tuyết

source: Mixed snow and sleet
be: Мокры снег
bg: Сняг и суграшица
el: Χιόνι και χιονόνερο
eu: Elurra eta elurbusti nahastuta
gl: Neve e sarabia
hr: Miješani snijeg i susnježica
lt: Sniegas bei šlapdriba
lv: Sniegs ar lietu
ms: Salji dan hujan ais
pl: Śnieg z deszczem
ro: Ninsoare și lapoviță amestecate
si: තුෂාර හිම
sk: Sneh s mrholením
tr: Kar ve sulu kar
uk: Сніг та снігова крупа
vi: Tuyết và mưa tuyết

source: Moderate or heavy freezing rain
be: Умераны альбо моцны ледзяны дождж
bg: Умерен до силен леден дъжд
el: Μέτρια ή Ισχυρή παγωμένη βροχή
eu: Euri izozkor moderatua
gl: Choiva xeada moderada ou forte
hr: Umjerena ili jaka ledena kiša
lt: Vidutinio stiprumo ar stipri lijundra
lv: Mērens vai smags sasalstošs lietus
pl: Umiarkowany lub silny, marznący deszcz
ro: Ploaie înghețată moderată sau puternică
si: මධ්‍යම හෝ ධාරානිපාත හිමායන වර්ෂාව
sk: Mierny alebo silný mrznúci dážď
tr: Orta veya ağır karla karışık yağmur
uk: Помірний або сильний дощ та ожеледиця
vi: Mưa lạnh vừa và to

source: Moderate or heavy rain in area with thunder
be: Умераны альбо моцны дождж з навальніцай
bg: Умерен до силен дъжд на места с гръмотевици
el: Μέτρια ή ισχυρή βροχόπτωση με κεραυνούς κατά τόπους
eu: Euri moderatua edo astuna trumoidun arean
gl: Choiva moderada ou intensa con raios
hr: Umjerena ili jaka kiša s mjestimičnom grmljavinom
lt: Vidutinio stiprumo ar stiprus lietus vietomis su perkūnija
lv: Mērens vai smags lietus ar pērkonu
ms: Hujan sederhana atau berat di kawasan dengan guruh
pl: Zmienne deszcze z burzami
ro: Ploaie cu trăznete moderată sau puternică
si: අකුණු සහිත මධ්‍යම හෝ ධාරානිපාත වර්ෂා
sk: Stredný alebo silný dážď s búrkou
tr: Orta veya ağır gökgürültülü fırtına
uk: Помірні або сильні дощі з грозами
vi: Mưa vừa và to, kèm sấm chớp

source: Moderate or heavy rain shower
be: Умераны альбо моцны дождж
bg: Умерен до силен дъжд
el: Μέτρια ή Ισχυρή πυκνή βροχή
eu: Euri zaparrada moderatua edo astuna
gl: Chuvascos moderados ou intensos
hr: Umjerena ili jaka kiša s pljuskovima
lt: Vidutinio stiprumo ar stipri liūtis
lv: Mērens vai smags īslaicīgs lietus
ms: hujan sederhana atau berat
pl: Umiarkowany lub silny, przelotny deszcz
ro: Averse de ploaie moderate sau puternice
si: මධ්‍යම හෝ ධාරානිපාත වර්ෂා
sk: Stredné alebo silné dažďové prehánky
tr: Orta veya hafif sağanak geçişleri
uk: Помірні або сильні зливи
vi: Mưa vừa, mưa to

source: Moderate or heavy showers of ice pellets
be: Умераны альбо моцны град
bg: Умерен до силен дъжд и лед
el: Μέτρια ή Ισχυρή μπόρα με χαλάζι
gl: Sarabia moderada ou intensa
hr: Umjereni ili jaki pljuskovi sa sitnijom tučom
lt: Vidutinio stiprumo ar stipri ledo liūtis
lv: Mērens vai smags lietus no ledus granulām
ms: sederhana atau berat hujan ais
pl: Umiarkowane lub silne, przelotne ziarna lodowe lub deszcz lodowy
ro: Averse moderate sau intense de grindină
si: අයිස් සහිත මධ්‍යම හෝ ධාරානිපාත වර්ෂා
sk: Stredný alebo silný dážď s krúpami
tr: Orta veya hafif sulu kar geçişleri
uk: Помірні або сильні опади крижаної крупи
vi: Mưa vừa, mưa to kèm theo đá

source: Moderate or heavy sleet showers
be: Умераны альбо моцны мокры снег
bg: Умерена до силна суграшица с дъжд
el: Μέτρια ή Ισχυρή μπόρα με χιονόβροχο
eu: Elur zaparrada moderatua edo astuna
gl: Choivas xeadas moderadas ou intensas
hr: Umjerena ili jaka gusta susnježica
lt: Vidutinio stiprumo ar stiprios šlabdribos liūtys
lv: Mērens vai smags īslaicīgs lietus ar sniegu
ms: hujan ais sederhana atau berat
pl: Umiarkowany lub silny, przelotny deszcz ze śniegiem
ro: Averse de lapoviță moderate sau puternice
si: හිම සහිත මධ්‍යම හෝ ධාරානිපාත වර්ෂා
sk: Stredné alebo silné prehánky dážďa so snehom
tr: Orta veya ağır sulu kar geçişleri
uk: Помірні або сильні снігопади
vi: Mưa đá vừa và to

source: Moderate or heavy sleet
be: Умераны альбо моцны мокры снег
bg: Умерена до силна суграшица
el: Μέτριο ή Ισχυρό χιονόβροχο
gl: Choivas xeadas moderadas ou intensas
hr: Umjerena ili jaka susnježica
lt: Vidutinio stiprumo ar stipri šlapdriba
lv: Mērens vai smags īslaicīgs lietus ar sniegu
ms: Hujan ais (sederhana atau berat)
pl: Umiarkowany lub silny deszcz ze śniegiem
ro: Lapoviță moderată sau puternică
si: මධ්‍යම හෝ ධාරානිපාත හිමපතනය
sk: Stredný alebo silný dážď so snehom
tr: Orta veya ağır sulu kar
uk: Помірний або сильний дощ зі снігом
vi: Mưa đá vừa và to

source: Moderate or heavy snow in area with thunder
be: Умераны альбо моцны снег з навальніцай
bg: Умерен до силен снеговалеж с гръмотевици
el: Μέτριο ή Ισχυρό χιόνι σε περιοχή κεραυνών
eu: Elurra neurrian ekaitz aukerarekin
gl: Neve moderada ou intensa con raios
hr: Umjereni ili jači snijeg s mjestimičnom grmaljavinom
lt: Vidutinio stiprumo ar stiprus snygis vietomis su perkūnija
lv: Mērena vai smaga snigšana ar pērkonu
ms: Hujan ais (sederhana atau berat) dikawasan guruh
pl: Lokalne umiarkowane lub intensywne opady śniegu z piorunami
ro: Ninsoare moderată sau intensă însoțită de fulgere
si: අකුණු සහිත මධ්‍යම හෝ ධාරානිපාත හිමපතනය
sk: Stredné alebo silné snženie v okolí s hrmením
tr: Orta veya ağır kar fırtınası
uk: Помірний або сильний снігопад, місцями грози
vi: Tuyết rơi vừa và nhiều, một vài nơi có sấm sét

source: Moderate or heavy snow showers
be: Умераны альбо моцны снегапад
bg: Умерен до силен снеговалеж
el: Μέτριες ή Ισχυρές χιονοπτώσεις
eu: Elur erauntsia neurrian
gl: Nevaradas moderadas ou intensas
hr: Umjereni ili jači gust snijeg
lt: Vidutinio stiprumo ar stiprus snygis
lv: Mērena vai smaga īslaicīga snigšana
ms: Hujan salji (sederhana atau berat)
pl: Umiarkowany lub silny, przelotny śnieg
ro: Averse moderate sau intense de zăpadă
si: මධ්‍යම හෝ ධාරානිපාත හිමපතනය
sk: Mierne alebo silné snehové prehánky
tr: Orta veya ağır kar geçişleri
uk: Помірний або сильний сніг
vi: Mưa đá vừa và to

source: Moderate rain at times
be: Часамі невялікі дождж
bg: Умерен дъжд
el: Μέτρια βροχή ανά διαστήματα
eu: Euria neurrian tarteka
gl: Choiva moderada intermitente
hr: Povremeno umjerena kiša
lt: Kartais vidutinio stiprumo lietus
lv: Reizēm mērens lietus
pl: Przelotne umiarkowane opady deszczu
ro: Ploaie moderată ocazională
si: කඩින් කඩ මඳ වැසි
sk: Občasný mierny dážď
tr: zaman zaman yağmurlu
uk: Часом помірний дощ
vi: Mưa vừa

source: Moderate rain
be: Невялікі дождж
bg: Умерен дъжд
el: Μέτρια βροχή
eu: Euria neurrian
gl: Choiva moderada
hr: Umjerena kiša
lt: Vidutinio stiprumo lietus
lv: Mērens lietus
ms: Hujan sederhana lebat
pl: Umiarkowany deszcz
ro: Ploaie moderată
si: තරමක් තද වැස්ස
sk: Mierny dážď
tr: Orta şiddette yağmur
uk: Помірний дощ
vi: Mưa vừa

source: Moderate snow
be: Умераны снегапад
bg: Умерен снеговалеж
el: Μέτρια χιονόπτωση
eu: Elurra neurrian
gl: Neve moderada
hr: Umjereni snijeg
lt: Vidutinio stiprumo snygis
lv: Mērena snigšana
ms: Salji sederhana lebat
pl: Umiarkowany śnieg
ro: Ninsoare moderată
si: තරමක් මද හිම
sk: Občasné sneženie
tr: Orta şiddette kar yağışı
uk: Помірний сніг
vi: Tuyết vừa

source: Mostly cloudy
be: Пераважна пахмурна
bg: Предимно облачно
el: Κυρίως νεφελώδης
eu: Batik bat lainotsua
gl: Principalmente nubrado
hr: Pretežno oblačno
lt: Debesuota su pragiedruliais
lv: Pārsvarā apmācies
ms: Hampir mendung
pl: Przewaga chmur
ro: În general noros
si: වලාකුළු වලින් බර
sk: Prevažne zamračené
tr: Çoğunlukla bulutlu
uk: Переважно хмарно
vi: Hầu như đầy mây

source: Mostly sunny
be: Пераважна сонечна
bg: Предимно слънчево
el: Κυρίως ηλιοφάνεια
eu: Goraki eguzkitsuetan
gl: Principalmente sol
hr: Pretežno sunčano
lt: Dažniausiai saulėta
lv: Pārsvarā saulains
ms: Keseluruhannya cerah
pl: Przewaga słońca
ro: În general însorit
si: පැහැදිලි
sk: Prevažne slnečno
tr: Çoğunlukla güneşli
uk: Переважно сонячно
vi: Hầu hết có nắng

source: Not available
be: Не даступна
bg: Не е налично
el: Μη διαθέσιμο
eu: Ez dago erabilgarri
gl: Non dispoñíbel
hr: Nedostupno
lt: Neprieinama
lv: Nav pieejams
ms: Tidak tersedia
pl: Niedostępny
ro: Indisponibil
si: නොපවතී
sk: Nedostupné
tr: Mevcut değil
uk: Недоступний
vi: Không sẵn dùng

source: Overcast
be: Суцэльная воблачнасць
bg: Плътна облачност
el: Νεφελώδης
eu: Zeru estalia
gl: Cuberto
hr: Tmurno
lt: Apsiniaukę
lv: Apmācies
ms: Mendung
pl: Pochmurno
ro: Cer acoperit
si: අහස වළාකුලු වලින් වැසුනු
sk: Zatiahnuté
tr: Bulutla kaplı
uk: Суцільна хмарність
vi: U ám

source: Partial fog
be: Часамі туман
bg: Частична мъгла
el: Μερική ομίχλη
eu: Lainoa tarteka
gl: Parcialmente cuberto de brétema
hr: Djelomičo maglovito
lt: Vietomis rūkas
lv: Daļēja migla
ms: Separa kabus
pl: Częściowe zamglenie
ro: Ceață parțială
si: කොටසක් මීදුමෙන් වැසී ගිය
sk: Častočné hmly
tr: Yer yer sisli
uk: Часом туман
vi: Sương mù rải rác

source: Partly cloudy
be: Воблачна з праясненнямі
bg: Частична облачност
el: Μερικώς νεφελώδης
eu: Hodeiak tarteka
gl: Parcialmente nubrado
hr: Djelomično oblačno
lt: Vietomis debesuota
lv: Brīžiem mākoņains
ms: Separa mendung
pl: Częściowe zachmurzenie
ro: Parțial înnorat
si: කොටසක් වළාකුලු වලින් වැසී ගිය
sk: Polojasno
tr: Parçalı bulutlu
uk: Місцями хмарно
vi: Một phần có mây

source: Partly sunny
be: Месцамі сонечна
bg: Частично слънчево
el: Μερική ηλιοφάνεια
eu: Eguzkia tarteka
gl: Sol intermitente
hr: Djelomično sunčano
lt: Vietomis saulėta
lv: Brīžiem saulains
ms: Separa cerah
pl: Częściowo słonecznie
ro: Parțial însorit
si: අර්ධ වශයෙන් පැහැදිලි
sk: Zamračené
tr: Yarı güneşli
uk: Місцями сонячно
vi: Một phần có nắng

source: Patches of fog
be: Месцамі туман
bg: Мъгла на отделни места
el: Ομίχλη κατά τόπους
eu: Laino-guneak
gl: Bancos de brétema
hr: Mjestimično maglovito
lt: Vietomis rūkas
lv: Vietām migla
ms: Kabus di sana sini
pl: Lokalne mgły
ro: Pâlcuri de ceață
si: මිදුම් සේයා
sk: Miestami hmly
tr: Yer yer sisli
uk: Місцями туман
vi: Sương mù vài nơi

source: Patchy freezing drizzle nearby
be: Месцамі намаразь
bg: Район с частична слана
el: Κατά τόπους χιονόνερο
gl: Orballo xeado illado preto
hr: Ponegdje mjestimična smrznuta rosulja
lt: Protarpiais lijundra
lv: Netālu fragmentāri sasalstoši smidzina
ms: Sesetengah hujan gerimis yang berdekatan
pl: Przelotne marznące mżawki
ro: Pâlcuri de burniță înghețată în apropiere
si: අසල හිමායන හිරි පොද
sk: Miestami občasné mrznúce mrholenie
tr: Yer yer karla karışık yağmur
uk: Місцями паморозь
vi: Bụi tuyết gần kề

source: Patchy heavy snow
be: Месцамі моцны снег
bg: На места силен снеговалеж
el: Κατά τόπους ισχυρή χιονόπτωση
gl: Neve forte dispersa
hr: Mjestimice gust snijeg
lt: Protarpiais daug sniego
lv: Fragmentāri smaga snigšana
ms: Separa salji berat
pl: Miejscowe śnieżyce
ro: Pâlcuri de ninsoare puternică
si: ධාරානිපාත හිමපතනයක සේයා
sk: Miestami silné sneženie
tr: Yer yer yoğun kar yağışı
uk: Місцями сильний сніг
vi: Tuyết rơi nặng

source: Patchy light drizzle
be: Месцамі мелкі дробны дождж
bg: Разкъсана облачност и лек ръмеж
el: Κατά τόπους ελαφριά ψιχάλα
gl: Orballo illado
hr: Mjestimice slaba rosulja
lt: Protarpiais lengva dulksna
lv: Fragmentāri viegla smidzināšana
pl: Przelotne mżawki
ro: Pâlcuri de burniță ușoară
si: මඳ හිමපතනයක සේයා
sk: Občasné slabé mrholenie
tr: Yer yer çiseleyen yağmur
uk: Місцями невелика хмарність
vi: Tuyết rơi nhẹ

source: Patchy light rain in area with thunder
be: Месцамі невялікі дождж з громам
bg: Разкъсана облачност и гръмотевици
el: Κατά τόπους ασθενής βροχόπτωση με κεραυνούς
gl: Choiva lixeira dispersa en área con raios
hr: Mjestimice slabija kiša s grmljavinom
lt: Protarpiais silpnas lietus su perkūnija
lv: Fragmentāri viegls lietus ar pērkonu vietām
pl: Przelotne deszcze z burzami
ro: Ploaie pe alocuri însoțită de fulgere
si: ප්‍රදේශයේ අකුණු සහිත මඳ වැසි සේයා
sk: Mrholenie s možnosťou lokálnych búrok
tr: Yer yer hafif yağmur ve fırtına
uk: Місцями невеликий дощ із грозами
vi: Mưa nhỏ kèm sấm chớp

source: Patchy light rain
be: Месцамі невялікі дождж
bg: На моменти лек дъжд
el: Κατά τόπους ασθενής βροχόπτωση
gl: Choiva lixeira dispersa
hr: Mjestimice slaba kiša
lt: Protarpiais silpnas lietus
lv: Fragmentāri viegls lietus
pl: Przelotne deszcze
si: මඳ වැසි සේයා
sk: Občasný slabý dážď
tr: Yer yer hafif yağmur
uk: Місцями невеликий дощ
vi: Mưa nhỏ

source: Patchy light snow in area with thunder
be: Месцамі слабы снег з громам
bg: Разкъсана облачност с лек снеговалеж и гръмотевици
el: Κατά τόπους ασθενής χιονόπτωση με κεραυνούς
gl: Neve lixeira dispersa en área con raios
hr: Mjestimice slab snijeg s grmljavinom
lt: Protarpiais silpnas snygis su perkūnija
lv: Fragmentāri viegla snigšana ar pērkonu vietām
pl: Przelotne opady śniegu z burzami
si: ප්‍රදේශයේ ගිගුරුම් සහිත මඳ හිමපතනයක සේයා
sk: Miestami slabé sneženie so snehovými búrkami
tr: Yer yer hafif kar ve fırtına
uk: Місцями невеликий сніг, можливі бурі
vi: Tuyết rơi nẹ kèm sấm chớp

source: Patchy light snow
be: Месцамі слабы снег
bg: Разскъсан снеговалеж
el: Κατά τόπους ασθενής χιονόπτωση
gl: Neve lixeira dispersa
hr: Mjestimice slab snijeg
lt: Protarpiais silpnas snygis
lv: Fragmentāri viegla snigšana
pl: Przelotne opady śniegu
ro: Pâlcuri de ninsoare
si: මඳ හිමපතනයක සේයා
sk: Občasné slabé sneženie
tr: Yer yer hafif kar yağışı
uk: Місцями невеликий сніг
vi: Tuyết rơi nhẹ
