Repository: Jalakas/my-weather-indicator
Catalog: po/*.po
Languages: be, bg, el, eu, gl, hr, lt, lv, ms, pl, ro, si, sk, tr, uk, vi

source: Patchy moderate snow
be: Месцамі умераны снег
bg: Разскъсан умерено силен снеговалеж
el: Κατά τόπους μέτρια χιονόπτωση
gl: Neve moderada dispersa
hr: Mjestimice umjeren snijeg
lt: Protarpiais vidutinio sunkumo snygis
lv: Fragmentāri mērens sniegs
pl: Przelotne śnieżyce
ro: Pâlcuri de ninsoare moderată
si: මධ්‍යම හිමපතනයක සේයා
sk: Občasné sneženie
tr: Yer yer orta şiddette kar yağışı
uk: Місцями помірний сніг
vi: Tuyết rơi vừa

source: Patchy rain nearby
be: Месцамі дажджы
bg: На моменти дъжд
el: Κατά τόπους βροχόπτωση
gl: Choiva illada preto
hr: Ponegdje mjestimična kiša
lt: Protarpiais lietus
lv: Netālu fragmentārs lietus
pl: Przelotne opady w okolicy
ro: Pâlcuri de ploaie în apropiere
si: ආසන්නයේ වර්ෂාවකි
sk: Občasný dážd
tr: Yer yer yağmur geçişleri
uk: Подекуди дощ
vi: Mưa gần kề

source: Patchy sleet nearby
be: Месцамі мокры снег
bg: Район с лека суграшица
el: Κατά τόπους χιονοθύελλα
gl: Auganeve illada preto
hr: Ponegdje mjestimična susnježica
lt: Protarpiais šlabdriba
lv: Netālu fragmentārs lietus ar sniegu
pl: Przelotne deszcze ze śniegiem w okolicy
si: ආසන්නයේ හිම සහිත වැස්සකි
sk: Miestami občasná čľapkanica
tr: Yer yer sulu kar geçişleri
uk: Подекуди мокрий сніг
vi: Mưa đá gần kề

source: Patchy snow nearby
be: Месцамі снег
bg: Район с лек снеговалеж
el: Κατά τόπους χιονόπτωση
gl: Neve illada preto
hr: Ponegdje mjestimični snijeg
lt: Protarpiais sniegas
lv: Netālu fragmentāra snigšana
pl: Przelotne śnieżyce w okolicy
si: ආසන්නයේ හිමපතනයකි
sk: Občasné sneženie
tr: Yer yer kar yağışı
uk: Подекуди мокрий сніг
vi: Tuyết rơi gần kề

source: Ragged thunderstorm
be: Месцамі навальніца
bg: Разпокъсана буря
el: Μανιώδης καταιγίδα
gl: Tormenta eléctrica fragmentada
hr: Glasna grmljavina
lt: Galima audra
lv: Robains pērkona negaiss
pl: Zmienne burze
si: කඩින් කඩ අකුණු ධාරා
sk: Nepravidelné búrky
tr: Düzensiz ara ara fırtına
uk: Місцями грози
vi: Bão lớn

source: Rain and snow
be: Дождж са снегам
bg: Дъжд и сняг
el: Βροχή και χιόνι
eu: Euria eta elurra
gl: Auganeve
hr: Kiša i snijeg
lt: Lietus ir sniegas
lv: Lietus un sniegs
ms: Hujan & salji
pl: Śnieg z deszczem
ro: Ploaie și zăpadă
si: වැසි සහ හිම
sk: Dážď so snehom
tr: Karla karışık yağmurlu
uk: Дощ зі снігом
vi: Có mưa và tuyết

source: Rain mist
be: Дробны дождж
bg: Дъжд и мъгла
el: Βροχή με ομίχλη
eu: Euri lainoa
gl: Poalla
hr: Kišna izmaglica
lt: Dulksna
lv: Lietus migla
ms: Kabus hujan
pl: Mżawka
ro: Ploaie cu ceață
si: වැහි මීදුම
sk: Vytváranie hmly
tr: Sisli ve yağmurlu
uk: Дощ з туманом
vi: Sương mù

source: Rain showers
be: Ліўні
bg: Превалявания от дъжд
el: Μπόρες
eu: Euri-zaparradak
gl: Chuvascos
hr: Pljuskovi
lt: Stiprus lietus
lv: Lietusgāzes
ms: Hujan renyai-renyai
pl: Deszcz
ro: Averse de ploaie
si: වර්ෂාව
sk: Dažďové prehánky
tr: Kısa yoğun yağmur
uk: Зливи
vi: Mưa rào

source: Rain
be: Дождж
bg: Дъжд
el: Βροχή
eu: Euria
gl: Choiva
hr: Kiša
lt: Lietus
lv: Lietus
ms: Hujan
pl: Deszcz
ro: Ploaie
si: වර්ෂාව
sk: Dážď
tr: Yağmurlu
uk: Дощ
vi: Mưa

source: Sand
be: Вецер з пяском
bg: Пясък
el: Άμμος
eu: Harea
gl: Area
hr: Pijesak
lt: Smėlis
lv: Smiltis
ms: Pasir
pl: Piasek
ro: Nisip
si: වැලි
sk: Piesok
tr: Kum fırtınalı
uk: Пісок
vi: Cát bay

source: Sandstorm
be: Пясчаная бура
bg: Пясъчна буря
el: Αμμοθύελλα
eu: Harea-ekaitza
gl: Tormenta de area
hr: Pješčana oluja
lt: Smėlio audra
lv: Smilšu vētra
ms: Ribut pasir
pl: Burza piaskowa
ro: Furtună de nisip
si: වැලි කුණාටු
sk: Piesočná búrka
tr: Kum fırtınalı
uk: Піщана буря
vi: Bão cát

source: Scattered clouds
be: Рассеяныя аблокі
bg: Разпръсната облачност
el: Διάσπαρτα σύννεφα
eu: Hodei bakanak
gl: Nubes illadas
hr: Raspršeni oblaci
lt: Išsisklaidę debesys
lv: Izkliedēti mākoņi
ms: Awan berselerak
pl: Kłębiaste chmury
ro: Nori răzleți
si: විසිරුණු වලාකුළු
sk: Ojedinelá oblačnosť
tr: Dağınık bulutlu
uk: Місцями хмарно
vi: Nhiều mây rải rác

source: Scattered showers
be: Месцамі ападкі
bg: Разпокъсани превалявания
el: Αραιές βροχοπτώσεις
eu: Zaparrada sakabanatuak
gl: Chuvascos illados
hr: Razasuti pljuskovi
lt: Vietomis liūtys
lv: Izkliedēts īslaicīgs lietus
ms: Hujan lari berselerak
pl: Przelotne opady
ro: Averse răzlețe
si: තැනින් තැන වර්ෂාව
sk: Ojedinelé prehánky
tr: Yer yer yağmurlu
uk: Подекуди зливи
vi: Mưa rào rải rác

source: Scattered thunderstorms
be: Месцамі навальніцы
bg: Разпокъсани гръмотевични бури
el: Αραιές καταιγιδες
eu: Trumoi-ekaitz sakabanatuak
gl: Tormentas eléctricas illadas
hr: Razasute oluje s grmljavinom
lt: Vietomis perkūnija
lv: Izkliedēts pērkona negaiss
ms: Ribut petir berselerak
pl: Przelotne burze z piorunami
ro: Furtuni răzlețe
si: තැනින් තැන අකුණු
sk: Ojedinelé búrky
tr: Yer yer gökgürültülü
uk: Місцями грози
vi: Dông rải rác

source: Shallow fog
be: Прыземны туман
bg: Незначителна мъгла
el: Ασθενής ομίχλη
eu: Laino oso itxia
gl: Néboa lixeira
hr: Slabašna magla
lt: Paviršinis rūkas
lv: Neliela migla
ms: Kabus tidak tebal
pl: Rzadka mgła
ro: Ceață superficială
si: මඳ මීදුම
sk: Slabé hmly
tr: Sisli
uk: Незначний туман
vi: Sương mù loáng thoáng

source: Showers
be: Ападкі
bg: Проливен дъжд
el: Μπόρες
eu: Zaparradak
gl: Chuvascos
hr: Pljuskovi
lt: Liūtys
lv: Lietusgāzes
ms: Hujan
pl: Przelotne deszcze
ro: Averse
si: මඳ වැසි
sk: Prehánky
tr: Sağanak yağmurlu
uk: Зливи
vi: Mưa rào

source: Shower drizzle
be: Зацяжны дождж
bg: Обилен валеж
el: Πυκνό ψιχάλισμα
eu: Sirimiri zaparrada
gl: Orballo
hr: Gusta rosulja
lt: Dulksna
lv: Īslaicīgi smidzina
ms: Hujan rintik-rintik
pl: Przelotna mżawka
si: හිරිපොද වැසි
sk: Mrholenie
tr: Yağmur çiselemesi geçişleri
uk: Сильна мряка
vi: Mưa phùn

source: Shower rain
be: Лівень
bg: Обилен дъжд
el: Πυκνή βροχή
eu: Euri zaparrada
gl: Treboadas
hr: Gusta kiša
lt: Gausūs lietūs
lv: Īslaicīgs lietus
ms: Hujan
pl: Przelotny deszcz
si: වැසි
sk: Dážď
tr: Sağanak yağmur
uk: Сильні дощі
vi: Mưa

source: Shower snow
be: Снегапад
bg: Обилен снеговалеж
el: Πυκνή χιονόπτωση
eu: Elur zaparrada
gl: Nevaradas
hr: Gust snijeg
lt: Gausus sniegas
lv: Īslaicīgs sniegs
ms: Salji
pl: Przelotny śnieg
si: හිමපතනය
sk: Sneženie
tr: Kar geçişleri
uk: Снігопад
vi: Tuyết rơi

source: Sleet
be: Мокры снег
bg: Киша
el: Χιονόνερο
eu: Elurbustia
gl: Auganeve
hr: Susnježica
lt: Šlapdriba
lv: Slapjdraņķis
ms: Hujan Beku
pl: Deszcz ze śniegiem
ro: Lapoviță
si: හිම වැස්ස
sk: Čľapkanica
tr: Karla karışık yağmurlu
uk: Мокрий сніг
vi: Mưa tuyết

source: Small hail showers
be: Невялікі град
bg: Лека градушка и дъжд
el: Μικρό χαλάζι με βροχή
eu: Kazkabar txikien zaparrada
gl: Sarabiadas
hr: Mjestimični pljuskovi s tučom
lt: Lietus su nežymia kruša
lv: Neliela īslaicīga krusa
ms: Hujan batu sederhana
pl: Przelotne opady gradu
ro: Averse de grindină mică
si: මද හිම කැට වැසි
sk: Veľmi slabé sneženie
tr: Dolu yağışlı
uk: Невеликі зливи з градом
vi: Mưa đá nhỏ

source: Small hail
be: Мелкі град
bg: Краткотрайна градушка
el: Μικρό χαλάζι
eu: Kazkabar txikia
gl: Sarabia pequena
hr: Slaba tuča
lt: Silpna kruša
lv: Neliela krusa
ms: Hujan batu kecil
pl: Lekki grad
ro: Grindină mică
si: මද හිම කැට
sk: Veľmi slabé krúpi
tr: Dolu yağışlı
uk: Дрібний град
vi: Mưa đá-nhỏ

source: Smoke
be: Смог
bg: Дим
el: Καπνός
eu: Kea
gl: Brétema lixeira
hr: Dim
lt: Dūmai
lv: Tvaiks
ms: Asap
pl: Dym
ro: Fum
si: දුම
sk: Oblačno
tr: Sisli
uk: Смог
vi: Sương khói

source: Snow flurries
be: Снежныя віхуры
bg: Снеговалеж
el: Χιονοπτώσεις
eu: Elur-jasak
gl: Folerpas de neve
hr: Snježni naleti
lt: Sniego šuorai
lv: Sniega brāzmas
ms: Banjiran salji
pl: Niewielkie opady śniegu
si: හදිසි ලුහු වැසි
sk: Snehové prehánky
tr: Tipi
uk: Завірюха
vi: Tuyết bất chợt

source: Snow grains
be: Зярністы снег
bg: Суграшица с прекъсвания
el: Νιφάδες χιονιού
eu: Elur-birrina
gl: Graos de neve
hr: Susnježica
lt: Pasnigs
lv: Sniega graudi
ms: Bijian salji
pl: Lekkie opady śniegu
ro: Grindină și ninsoare
si: හිම වැටෙන
sk: Snehová porývka
tr: Karlı
uk: Сніжна крупа
vi: Hoa tuyết

source: Snow showers
be: Снежныя ападкі
bg: Снеговалежи
el: Χιονόνερο
eu: Elur-zaparradak
gl: Nevaradas
hr: Mećave
lt: Sniegas
lv: Sniega gāzes
ms: Hujan salji
pl: Przelotne opady śniegu
ro: Averse de ninsoare
si: හිමපතනය
sk: Snehové prehánky
tr: Kısa yoğun karlı
uk: Хурделиця
vi: Mưa tuyết

source: Snow
be: Снег
bg: Сняг
el: Χιόνι
eu: Elurra
gl: Neve
hr: Snijeg
lt: Sniegas
lv: Sniegs
ms: Salji
pl: Śnieg
ro: Ninsoare
si: හිම
sk: Sneženie
tr: Karlı
uk: Сніг
vi: Tuyết

source: Spray
be: Вадзяны пыл
bg: Ръмеж
el: Ελαφριά βροχόπτωση
eu: Zipriztinak
gl: Resío
hr: Kiša
lt: Purškimas
lv: Smidzina
ms: Semburan
pl: Mżawka
si: හිරිකඩ
sk: Spŕška
tr: Yağmur serpintisi
uk: Водяний пил
vi: Phun

source: Squalls
be: Шквалісты вецер
bg: Вихрушки
el: Μπουρίνι
eu: Haize-erauntsiak
gl: Refachos
hr: Zapusi vjetra s kišom
lt: Škvalas
lv: Brāzmas
ms: Badai
pl: Nawałnice
ro: Rafale
si: හදිස්සි කුණාටුව
sk: Víchrica
tr: Yağmurlu
uk: Шквалистий вітер

source: Storm
be: Моцны шторм
bg: Буря
el: Θύελλα
eu: Ekaitza
gl: Tormenta
hr: Oluja
lt: Audra
lv: Vētra
ms: Ribut
pl: Burza
ro: Furtună
si: කුණාටුව
sk: Búrka
tr: Fırtınalı
uk: Буря
vi: Gió bão

source: Sunny
be: Сонечна
bg: Слънчево
el: Λιακάδα
eu: Eguzkitsu
gl: Sol
hr: Sunčano
lt: Saulėta
lv: Saulains
ms: Cerah
pl: Słonecznie
ro: Însorit
si: පැහැබර
sk: Slnečno
tr: Güneşli
uk: Сонячно
vi: Nắng

source: Thunderstorm
be: Навальніца
bg: Гръмотевична буря
el: Καταιγίδα με κεραυνούς
eu: Trumoi-ekaitza
gl: Tormenta eléctrica
hr: Oluja s grmljavinom
lt: Perkūnija
lv: Pērkona negaiss
ms: Ribut Petir
pl: Burza z piorunami
ro: Furtună cu descărcări electrice
si: අකුණු කුණාටු
sk: Blýskavica
tr: Gökgürültülü Fırtınalı
uk: Гроза
vi: Dông bão

source: Thunderstorms and ice pellets
be: Навальніца з градам
bg: Гръмотевични бури и леден дъжд
el: Καταιγίδα με κεραυνούς και χαλάζι
eu: Trumoi-ekaitz eta izotz-pikortak
gl: Tormentas eléctricas con sarabia
hr: Gmljavinsko nevrijeme sa sitnijom tučom
lt: Audra su perkūnija ir kruša
lv: Pērkona negaiss un ledus granulas
ms: Ribut petir & salji
pl: Burze i grad
si: හිම කැට සහිත අකුණු කුණාටු
sk: Búrky so snehom
tr: Buzlu fırtınalı
uk: Грози і крижана крупа
vi: Bão kèm mưa đá

source: Thunderstorms and rain
be: Дождж з навальніцай
bg: Гръмотевични бури и дъжд
el: Καταιγίδα με βροχόπτωση
eu: Trumoi-ekaitzak eta euria
gl: Tormentas eléctricas e choiva
hr: Olujno nevrijeme sa kišom
lt: Lietus su perkūnija
lv: Pērkona negaiss un lietus
ms: Ribut petir & salji
pl: Burze i opady deszczu
ro: Descărcări electrice și ploaie
si: අකුණු කුණාටු සහිත වැසි
sk: Búrky a dážď
tr: Gökgürültülü yağmurlu
uk: Дощі з грозами
vi: Mưa bão

source: Thunderstorms and snow
be: Навальніца са снегам
bg: Гръмотевици и сняг
el: Καταιγίδα με χιονόπτωση
eu: Trumoi-ekaitzak eta elurra
gl: Tormentas eléctricas e neve
hr: Olujno nevrijeme sa snijegom
lt: Audra su perkūnija ir sniegas
lv: Pērkona negaiss un sniegs
ms: Ribut petir & salji
pl: Burze i opady śniegu
ro: Descărcări electrice și ninsoare
si: අකුණුධාරා සමඟ හිම
sk: Búrky a sneh
tr: Kar fırtınalı
uk: Грози та сніг
vi: Dông và có tuyết

source: Thunderstorms with hail
be: Навальніца з градам
bg: Гръмотевици и градушка
el: Καταιγίδες με χαλάζι
eu: Trumoi-ekaitzak kazkabarrarekin
gl: Tormenta eléctrica con sarabia
hr: Olujno nevrijeme sa tučom
lt: Perkūnija ir kruša
lv: Pērkona negaiss ar krusu
ms: Badai & ribut petir
pl: Burze gradowe
ro: Descărcăti electrice cu grindină
si: අකුණුධාරා සමඟ හිම කැට
sk: Búrky s krúpami
tr: Fırtınalı dolu yağışlı
uk: Гроза з градом
vi: Báo kèm mưa đá

source: Thunderstorms with small hail
be: Навальніца з невялікім градам
bg: Гръмотевици и краткотрайна градушка
el: Καταιγίδες με μικρό χαλάζι
eu: Ekaitzak eta kazkabar txikia
gl: Tormentas eléctricas con sarabia pequena
hr: Olujno nevrijeme sa sitnom tučom
lt: Silpna kruša ir perkūnija
lv: Pērkona negaiss ar mazu krusu
ms: Badai sederhana & ribut petir
pl: Burza śnieżna
ro: Descărcări electrice cu grindină mică
si: කුඩා හිමපතනය සමඟ අකුණුධාරා
sk: Búrky s menšími krúpami
tr: Fırtınalı dolu yağışlı
uk: Гроза з дрібним градом
vi: Bão kèm mưa đá nhỏ

source: Thunderstorm with light rain
be: Навальніца, слабы дождж
bg: Буря и преваляване
el: Θύελλα με ελαφριά βροχή
eu: Trumoi-erasoa euri arinarekin
gl: Tormenta eléctrica con choiva lixeira
hr: Olujno nevrijeme sa slabijom kišom
lt: Audra su lengvu lietumi
lv: Pērkona negaiss ar vieglu lietu
ms: RIbut petir & hujan renyai-renyai
pl: Burza ze słabym deszczem
si: මඳ වැසි සහිත අකුණු කුණාටු
sk: Búrka s slabým dažďom
tr: Fırtına ve hafif yağmur
uk: Гроза та невеликий дощ
vi: Dông kèm mưa nhỏ

source: Thunderstorm with rain
be: Навальніца з дажджом
bg: Буря и дъжд
el: Θύελλα με βροχή
eu: Trumoi-ekaitza eurarekin
gl: Tormenta eléctrica con choiva
hr: Olujno nevrijeme sa kišom
lt: Audra su lietumi
lv: Pērkona negaiss ar lietu
ms: Ribut petir & hujan
pl: Burza z deszczem
si: වැසි සහිත අකුණු කුණාටු
sk: Búrka s dažďom
tr: Yağmur ve fırtına
uk: Гроза з дощем
vi: Dông và mưa

source: Thunderstorm with heavy rain
be: Навальніца, моцны дождж
bg: Буря с проливен дъжд
el: Θύελλα με ισχυρή βροχή
eu: Trumoi-erasoa euri astunarekin
gl: Tormenta eléctrica con choiva forte
hr: Olujno nevrijeme sa jakom kišom
lt: Audra su liūtimi
lv: Pērkona negaiss ar smagu lietu
ms: Ribut petir & hujan lebat
pl: Burza z silnym deszczem
si: ධාරානිපාත වැසි සහිත අකුණු කුණාටු
sk: Búrka so silným dažďom
tr: YOğun yağmur ve fırtına
uk: Гроза з сильним дощем
vi: Dông và mưa to

source: Thunderstorm with light drizzle
be: Навальніца, слабая імжа
bg: Буря и слаба поледица
el: Θύελλα με ελαφρύ ψιχάλισμα
eu: Trumoi-eraso sirimiri arinarekin
gl: Tormenta eléctrica con orballo
hr: Olujno nevrijeme sa slabijom rosuljom
lt: Audra su lengva dulksna
lv: Pērkona negaiss ar vieglu smidzināšanu
ms: Ribut petir & hujan renyai-renyai
pl: Burza ze słabą mżawką
si: මඳ හිරිකඩ සහිත අකුණු කුණාටු
sk: Búrka s jemným mrholením
tr: Fırtına ve hafif yağmur çiselemeleri
uk: Гроза з мрякою
vi: Dông và mưa phùn

source: Thunderstorm with drizzle
be: Навальніца, імжа
bg: Буря и поледица
el: Θύελλα με ψιχάλισμα
eu: Trumoi-erasoa sirimiriarekin
gl: Tormenta eléctrica con orballo
hr: Olujno nevrijeme sa slabijom kišom
lt: Audra su dulksna
lv: Pērkona negaiss ar smidzināšanu
ms: Ribut petir dan hujan rintik-rintik
pl: Burza z mżawką
si: හිරිකඩ සහිත අකුණු කුණාටු
sk: Búrka s mrholením
tr: Fırtına ve yağmur çiselemeleri
uk: Гроза з дощем
vi: Dông vơi mưa phùn

source: Thunderstorm with heavy drizzle
be: Навальніца, моцная імжа
bg: Буря и силна поледица
el: Θύελλα με ισχυρό ψιχάλισμα
eu: Trumoi-erasoa sirimiri astunarekin
gl: Tormenta eléctrica con orballo forte
hr: Olujno nevrijeme sa jakom rosuljom
lt: Audra su sunkia dulksna
lv: Pērkona negaiss ar smagu smidzināšanu
ms: Ribut petir dan hujan rintik-rintik yang agak lebat
pl: Burza z silną mżawką
si: ධාරානිපාත හිරිකඩ සහිත අකුණු කුණාටු
sk: Búrka so silným mrholením
tr: Fırtına ve yoğun yağmur çiselemeleri
uk: Гроза з сильним дощем
vi: Dông vơi mưa lớn

source: Thundery outbreaks in nearby
be: Месцамі навальніцы
bg: Район с зараждащи се бури
el: Κοντινές ηλεκτρικές εκκενώσεις
gl: Abrochos tormentosos preto
hr: Ponegdje jaka grmljavina
lt: Audros protrūkiai
lv: Negaisa uzliesmojumi tuvumā
ms: Cuaca gemuruh berdekatan
pl: Burzliwa pogoda w okolicy
si: අසල ප්‍රදේශයේ ගිගුරුම් පැතිරේ
sk: Možné búrky v okolí
tr: Gökgürültülü fırtına geçişleri
uk: Місцями грози
vi: Bão đến gần

source: Tornado
be: Смерч
bg: Торнадо
el: Τυφώνας
eu: Tornadoa
lt: Viesulas
lv: Virpuļviesulis
ms: Puting Beliung
pl: Trąba powietrzna
si: ටෝනාඩෝ
sk: Tornádo
tr: Kasırga
uk: Торнадо
vi: Bão táp

source: Tropical storm
be: Трапічны шторм
bg: Тропическа буря
el: Τροπική καταιγίδα
eu: Ekaitz tropikala
gl: Tormenta tropical
hr: Tropska oluja
lt: Tropinė audra
lv: Tropiskā vētra
ms: Ribut tropika
pl: Cyklon tropikalny
si: නිවර්තන සුළං
sk: Tropická búrka
tr: Tropik Fırtına
uk: Тропічний шторм
vi: Bão nhiệt đới

source: Unknown precipitation
be: Невядомыя ападкі
bg: Неизяснени валежи
el: Άγνωστη ατμοσφαιρική κατακρήμνιση
eu: Prezipitazio ezezaguna
gl: Precipitación descoñecida
hr: Nepoznate oborine
lt: Nežinomi krituliai
lv: Nezināmi nokrišņi
ms: Mendakan tak diketahui
pl: Nieznane opady
ro: Precipitații necunoscute
si: නොකිවහැකි වර්ෂා පතනය
sk: Neznáme zrážky
tr: Bilinmeyen ani düşüş
uk: Невідомі опади
vi: Mưa rào không xác định

source: Unknown
be: Невядома
bg: Непознат
el: 'Αγνωστο
eu: Ezezaguna
gl: Descoñecido
hr: Nepoznato
lt: Nežinoma
lv: Nezināms
ms: Tidak diketahui
pl: Nieznana
ro: Necunoscut
si: නොදත්
sk: Dosiaľ neznáme
tr: Bilinmiyor
uk: Немає даних
vi: Chưa xác định.

source: Very heavy rain
be: Вельмі моцны дождж
bg: Много проливен дъжд
el: Πολύ ισχυρή βροχή
eu: Oso euri astuna
gl: Choiva moi forte
hr: Vrlo jaka kiša
lt: Labai stiprus lietus
lv: Ļoti smags lietus
ms: Hujan lebat
pl: Bardzo silny deszcz
si: මහා වැසි
sk: Veľmi silný dážď
tr: Çok yoğun yağmur
uk: Дуже сильний дощ
vi: Mưa rất lớn

source: Volcanic ash
be: Вулканічны попел
bg: Вулканична пепел
el: Ηφαιστιακή στάχτη
eu: Errauts bolkanikoa
gl: Cinza volcánica
hr: Vulkanski pepeo
lt: Vulkaniniai pelenai
lv: Vulkāniskie pelni
ms: Abu gunung berapi
pl: Popiół wulkaniczny
ro: Cenușă vulcanică
si: යමහල් අළු
sk: Vulkanický popol
tr: Volkanik aktivite
uk: Вулканічний попіл
vi: Tro núi lửa

source: Widespread dust
be: Пылная бура
bg: Прашна буря
el: Εκτεταμένη σκόνη
eu: Hauts hedatua
gl: Po extenso
hr: Zapusi prašine
lt: Dulkių audra
lv: Plaši izplatīti putekļi
pl: Kurzawka
ro: Praf împrăștiat
si: විසිරුණු දූවිලි
sk: Rozsiahle prašno
tr: Toz fırtınalı
uk: Пил
vi: Bụi trên diện rộng

source: Windy
be: Ветрана
bg: Ветровито
el: Aνεμώδης
eu: Haizetsua
gl: Ventoso
hr: Vjetrovito
lt: Vėjuota
lv: Vējains
ms: Berangin
pl: Wietrznie
ro: Vântos
si: සුලං සහිතයි
sk: Veterno
tr: Rüzgârlı
uk: Вітряно
vi: Nhiều gió

source: North
be: Паўночны
bg: Север
el: Βόρειος
eu: Iparra
gl: Norte
hr: Sjeverni
lt: Šiaurės
lv: Ziemeļi
ms: Utara
pl: Z północy
ro: Nord
si: උතුර
sk: Severný
tr: Kuzey
uk: Північний
vi: Bắc

source: North by east
be: з Поўначы на Ўсход
bg: Северен от изток
el: Βόρειος με Ανατολικός
eu: Ipar-ekialdea
gl: Norte desde o leste
hr: Sjeveroistočni
lt: Šiaurės - rytų
lv: Uz ziemeļiem no austrumiem
pl: Z północy na wschód
si: නැගෙනහිර සිට උතුරු දෙසට
sk: Severovýchodný
tr: Kuzey ile kuzey - kuzeydoğu arası
uk: З північного на східний
vi: Bắc - Bắc-Đông Bắc

source: North-northeast
be: Паўночны - Паўночна-ўсходні
bg: Север-североизток
el: Βόρειος-βορειοανατολικός
eu: Ipar ipar-ekialde
gl: Norte-nordeste
hr: Sjever-sjeveroistočni
lt: Šiaurės - šiaurės rytų
lv: Ziemeļu-ziemeļaustrumu
pl: Z północy na północny-wschód
ro: Nord-nord-est
si: උතුර - ඊසාන
sk: Severo-severovýchodný
tr: Kuzey - kuzeydoğu
uk: Північний, північно-східний
vi: Bắc-Đông Bắc

source: Northeast by north
be: з Паўночна-ўсходу на Поўнач
bg: Североизток от север
el: Βορειοανατολικός με βόρειος
eu: Ipar-ekialde iparraldetik
gl: Nordeste desde o norte
hr: Sjeveroistočni-sjeverni
lt: Šiaurės rytų - Šiaurės
lv: Uz ziemeļaustrumiem no ziemeļiem
pl: Z północnego-wschodu na północ
si: උතුරේ සිට ඊසාන දිග දක්වා
sk: Severovýchodno severný
tr: Kuzeydoğu ile kuzey - kuzeydoğu arası
uk: З північно-східного на північний
vi: Đông Bắc - Bắc-Đông Bắc

source: Northeast
be: Паўночна-ўсходні
bg: Североизток
el: Βορειοανατολικός
eu: Ipar-ekialde
gl: Nordés
hr: Sjeveroistočni
lt: Šiaurės rytų
lv: Ziemeļaustrumu
ms: Timur laut
pl: Z północnego-wschodu
ro: Nord-Est
si: ඊසාන
sk: Severovýchodne
tr: Kuzeydoğu
uk: Північно-східний
vi: Đông Bắc

source: Northeast by east
be: з Паўночна-ўсходу на Ўсход
bg: Североизток от изток
el: Βορειοανατολικός με ανατολικός
eu: Ipar-ekialde ekialdetik
gl: Nordeste desde o leste
hr: Sjeveroistočni-istočni
lt: Šiaurės rytų - Rytų
lv: Uz ziemeļaustrumiem no austrumiem
pl: Z północnego-wschodu na wschód
si: නැගෙනහිර සිට ඊසාන දිග දක්වා
sk: Severovýchodno východný
tr: Kuzeydoğu ile doğu - kuzeydoğu arası
uk: З північно-східного на східний
vi: Đông Bắc - Đông-Đông Bắc

source: East-northeast
be: Усходні - Паўночна-ўсходні
bg: Изток-североизток
el: Ανατολικός-Βορειοανατολικός
eu: Ekialde ipar-ekialde
gl: Leste-nordés
hr: Istočni-sjeveroistočni
lt: Rytų - šiaurės rytų
lv: Austrumu-ziemeļaustrumu
pl: Ze wschodu na północny-wschód
ro: Est-nord-est
si: නැගෙනහිර - ඊසාන
sk: Východo-severovýchodný
tr: Doğu-kuzeydoğu
uk: Східний, північно-східний
vi: Đông-Đông Bắc

source: East by north
be: з Усходу на Поўнач
bg: Изток от север
el: Ανατολικός με βόρειος
eu: Ekialdera iparraldetik
gl: Este desde o norte
hr: Istočni-sjeverni
lt: Rytų - Šiaurės
lv: Uz austrumiem no ziemeļiem
ms: Timur utara
pl: Ze wschodu na północ
si: උතුරේ සිට නැගෙනහිර දක්වා
sk: Východoseverný
tr: Doğu ile doğu - kuzeydoğu arası
uk: Зі східниго на північний
vi: Đông - Đông-Đông Bắc

source: East
be: Усходні
bg: Изток
el: Ανατολικός
eu: Ekialdea
gl: Leste
hr: Istočni
lt: Rytų
lv: Austrumu
ms: Timur
pl: Ze wschodu
ro: Est
si: නැගෙනහිර
sk: Východný
tr: Doğu
uk: Східний
vi: Đông

source: East by south
be: з Усхода на Поўдзень
bg: Изток от юг
el: Ανατολικός με νότιος
eu: Ekialdera hegoaldetik
gl: Leste desde o sur
hr: Istočni-južni
lt: Rytų - Pietų
lv: Uz austrumiem no dienvidiem
ms: Timur selatan
pl: Ze wschodu na południe
si: දකුණේ සිට නැගෙනහිර දක්වා
sk: Východojužný
tr: Doğu ile doğu - güneydoğu arası
uk: Зі східного на південний
vi: Đông - Đông-Đông Nam

source: East-southeast
be: Усходні - Паўднёва-ўсходні
bg: Изток-югоизток
el: Ανατολικός-νοτιοανατολικός
eu: Ekialde hego-ekialde
gl: Este - sureste
hr: Istočni-južnoistočni
lt: Rytų - pietryčių
lv: Austrumu-dienvidaustrumu
ms: Timur - Tenggara
pl: Ze wschodu na południowy-wschód
ro: Est-sud-est
si: නැගෙනහිර - ගිනිකොන
sk: Východo-juhovýchodný
tr: Doğu - güneydoğu
uk: Східний, південно-східний
vi: Đông-Đông Nam

source: Southeast by east
be: з Паўднёва-ўсходу на Ўсход
bg: Югоизток от изток
el: Νοτιοανατολικός με ανατολικός
eu: Hegoekialdera ekialdetik
gl: Sureste desde o leste
hr: Južnoistočni-istočni
lt: Pietryčių - Rytų
lv: Uz dienvidaustrumiem no austrumiem
ms: Tenggara - Timur
pl: Z południowego-wschodu na wschód
si: නැගෙනහිර සිට ගිනිකොන දක්වා
sk: Juhovýchodovýchodný
tr: Güneydoğu ile doğu - güneydoğu arası
uk: З південно-східного на східний
vi: Đông Nam - Đông-Đông Nam

source: Southeast
be: Паўднёва-ўсходні
bg: Югоизток
el: Νοτιοανατολικός
eu: Hego-ekialde
gl: Sueste
hr: Jugoistočni
lt: Pietryčių
lv: Dienvidaustrumu
ms: Tenggara
pl: Z południowego-wschodu
ro: Sud-Est
si: ගිනිකොන
sk: Juhovýchodný
tr: Güneydoğu
uk: Південно-східний
vi: Đông Nam

source: Southeast by south
be: з Паўднёва-ўсходу на Поўдзень
bg: Югоизток от юг
el: Νοτιοανατολικός με νότιος
eu: Hego-ekialdera hegoaldetik
gl: Sureste desde o sur
hr: Južnoistočni-južni
lt: Pietryčių - Pietų
lv: Uz dienvidaustrumiem no dienvidiem
ms: Selatan tenggara
pl: Z południowego-wschodu na południe
si: දකුණේ සිට ගිනිකොන දක්වා
sk: Juhovýchodojužný
tr: Güneydoğu ile güney - güneydoğu arası
uk: З південно-східного на південний
vi: Đông Nam - Nam-Đông Nam

source: South-southeast
be: Паўднёвы - Паўднёва-ўсходні
bg: Юг-югоизток
el: Νότιος-Νοτιοανατολικός
eu: Hegoalde hego-ekialde
gl: Sur-sueste
hr: Južni-južnoistočni
lt: Pietų-pietryčių
lv: Dienvidu-dienvidaustrumu
ms: Selatan tenggara
pl: Z południa na południowy-wschód
ro: Sud-sud-est
si: දකුණ - ගිනිකොන
sk: Juh-juhovýchodný
tr: Güney - güneydoğu
uk: Південний, південно-східний
vi: Nam-Đông Nam

source: South by east
be: з Поўдня на Ўсход
bg: Юг от изток
el: Νότιος με ανατολικός
eu: Hegoaldea ekialdetik
gl: Sur desde o leste
hr: Južni-istočni
lt: Pietų - Rytų
lv: Uz dienvidiem no austrumiem
ms: Timur selatan
pl: Z południa na wschód
si: නැගෙනහිර සිට දකුණට
sk: Juhovýchodný
tr: Güney ile güney - güneydoğu arası
uk: З південного на східний
vi: Nam - Nam-Đông Nam

source: South
be: Паўднёвы
bg: Юг
el: Νότιος
eu: Hego
gl: Sur
hr: Južni
lt: Pietų
lv: Dienvidu
ms: Selatan
pl: Z południa
ro: Sud
si: දකුණ
sk: Južný
tr: Güney
uk: Південний
vi: Nam
