Repository: Jalakas/my-weather-indicator
Catalog: po/*.po
Languages: be, bg, el, eu, gl, hr, lt, lv, ms, pl, ro, si, sk, tr, uk, vi

source: South by west
be: з Поўдня на Захад
bg: Южен от запад
el: Νότιος με δυτικός
eu: Hegoaldea mendebaldetik
gl: Sur desde o oeste
hr: Južni-zapadni
lt: Pietų - Vakarų
lv: Uz dienvidiem no rietumiem
ms: Selatan - Barat
pl: Z południa na zachód
si: බටහිර සිට දකුණට
sk: Juhozápadný
tr: Güney ile güney - güneybatı arası
uk: З південного на західний
vi: Nam - Nam-Tây Nam

source: South-southwest
be: Паўднёвы - Паўднёва-заходні
bg: Юг-югозапад
el: Νότιος-νοτιοδυτικός
eu: Hego hego-mendebalde
gl: Sur-suroeste
hr: Južni-jugozapadni
lt: Pietų - pietvakarių
lv: Dienvidu-dienvidrietumu
ms: Selatan - Tenggara
pl: Z południa na południowy-zachód
ro: Sud-sud-vest
si: දකුණ - නිරිත
sk: Juh-juhozápad
tr: Güney - güneybatı
uk: Південний, південно-західний
vi: Nam-Tây Nam

source: Southwest by south
be: з Паўднёва-захаду на Поўдзень
bg: Югозапад от юг
el: Νοτιοδυτικός με δυτικός
eu: Hegomendebaldea hegoaldetik
gl: Suroeste desde o sur
hr: Jugozapadni-južni
lt: Pietvakarių - Pietų
lv: Uz dienvidrietumiem no dienvidiem
ms: Tenggara selatan
pl: Z południowego-zachodu na południe
si: දකුණේ සිට නිරිතට
sk: Juhozápadojužný
tr: güneybatı ile güney - güneybatı arası
uk: З південно-західного на південний
vi: Tây Nam - Nam-Tây Nam

source: Southwest
be: Паўднёва-заходні
bg: Югозападен
el: Νοτιοδυτικός
eu: Hego-mendebaldea
gl: Suroeste
hr: Jugozapadni
lt: Pietvakarių
lv: Dienvidrietumu
ms: Barat daya
pl: Z południowego-zachodu
ro: Sud-vest
si: නිරිත
sk: Juhozápad
tr: Güneybatı
uk: Південно-західний
vi: Tây Nam

source: Southwest by west
be: з Паўднёва-захаду на Захад
bg: Югоизточно от запад
el: Νοτιοδυτικός με δυτικός
eu: Hegomendebaldea mendebaldetik
gl: Suroeste desde o oeste
hr: Jugozapadni-zapadni
lt: Pietvakarių - Vakarų
lv: Uz dienvidrietumiem no rietumiem
pl: Z południowego-zachodu na zachód
si: බටහිර සිට නිරිතට
sk: Juhozápadozápadný
tr: Güneybatı ile batı - güneybatı arası
uk: З південно-західного на західний
vi: Tây Nam - Tây-Tây Nam

source: West-southwest
be: Паўднёвы - Паўднёва-заходні
bg: Запад-югозапад
el: Δυτικός-νοτιοδυτικός
eu: Mendebalde hego-mendebalde
gl: Oeste-suroeste
hr: Zapadni-jugozapadni
lt: Vakarų - pietvakarių
lv: Rietumu-dienvidrietumu
pl: Z zachodu na południowy-zachód
ro: Vest-sud-vest
si: බටහිර - නිරිත
sk: Západ-juhozápad
tr: Batı - güneybatı
uk: Західний, південно-західний
vi: Tây-Tây Nam

source: West by south
be: з Захаду на Поўдзень
bg: Западен от юг
el: Δυτικός με νότιος
eu: Mendebaldea hegoaldetik
gl: Oeste desde o sur
hr: Zapadni-južni
lt: Vakarų - Pietų
lv: Uz rietumiem no dienvidiem
pl: Z zachodu na południe
si: දකුණේ සිට බටහිරට
sk: Západno južný
tr: Batı ile batı - güneybatı arası
uk: З західного на південний
vi: Tây - Tây-Tây Nam

source: West
be: Заходні
bg: Запад
el: Δυτικός
eu: Mendebalde
gl: Oeste
hr: Zapadni
lt: Vakarų
lv: Rietumu
ms: Barat
pl: Z zachodu
ro: Vest
si: බටහිර
sk: Západný
tr: Batı
uk: Західний
vi: Tây

source: West by north
be: з Захаду на Поўнач
bg: Западен от север
el: Δυτικός με βόρειος
eu: Mendebaldea iparraldetik
gl: Oeste desde o norte
hr: Zapadni-sjeverni
lt: Vakarų - Šiaurės
lv: Uz rietumiem no ziemeļiem
pl: Z zachodu na północ
si: උතුරේ සිට බටහිරට
sk: Západoseverný
tr: Batı ile batı - kuzeybatı arası
uk: З західного на північний
vi: Tây - Tây-Tây Bắc

source: West-northwest
be: Заходні - Паўночна-заходні
bg: Запад-северозапад
el: Δυτικός-βορειοδυτικός
eu: Mendebalde ipar-mendebalde
gl: Oeste-noroeste
hr: Zapadni-sjeverozapadni
lt: Vakarų - šiaurės vakarų
lv: Rietumu-ziemeļrietumu
pl: Z zachodu na północny-zachód
ro: Vest-nord-vest
si: බටහිර - වයඹ
sk: Západ-severozápad
tr: Batı - kuzeybatı
uk: Західний, північно-західний
vi: Tây-Tây Bắc

source: Northwest by west
be: з Паўночна-захаду на Захад
bg: Северозападен от запад
el: Βορειοδυτικός με δυτικός
eu: Iparmendebaldea mendebaldetik
gl: Noroeste desde o oeste
hr: Sjeverozapadni-zapadni
lt: Šiaurės vakarų - Vakarų
lv: Uz ziemeļrietumiem no rietumiem
pl: Z północnego-zachodu na wschód
si: බටහිර සිට වයඹට
sk: Severozápadozápadný
tr: Kuzeybatı ile batı - kuzeybatı arası
uk: З північно-західного на західний
vi: Tây Bắc - Tây-Tây Bắc

source: Northwest
be: Паўночна-заходні
bg: Северозападен
el: Βορειοδυτικός
eu: Ipar-mendebaldea
gl: Noroeste
hr: Sjeverozapadni
lt: Šiaurės vakarų
lv: Ziemeļrietumu
pl: Z północnego-zachodu
ro: Nord-vest
si: වයඹ
sk: Severozápad
tr: Kuzeybatı
uk: Північно-західний
vi: Tây Bắc

source: Northwest by north
be: з Паўночна-захаду на Поўнач
bg: Северозападен от север
el: Βορειοδυτικός με βόρειος
eu: Iparmendebaldea iparraldetik
gl: Noroeste desde o norte
hr: Sjeverozapadni-sjeverni
lt: Šiaurės vakarų - Šiaurės
lv: Uz ziemeļrietumiem no ziemeļiem
pl: Z północnego-zachodu na północ
si: උතුරේ සිට වයඹට
sk: Severozápadno severný
tr: Kuzeybatı ile kuzey - kuzeybatı arası
uk: З північно-західного на північний
vi: Tây Bắc - Bắc-Tây Bắc

source: North-northwest
be: Паўночны - Паўночна-заходні
bg: Север-Северозапад
el: Βόρειος-βορειοδυτικός
eu: Ipar ipar-mendebalde
gl: Norte-noroeste
hr: Sjeverni-sjeverozapadni
lt: Šiaurės - šiaurės vakarų
lv: Ziemeļu-ziemeļrietumu
pl: Z północy na północny-zachód
ro: Nord-nord-vest
si: උතුර - වයඹ
sk: Severo-severozápadný
tr: Kuzey - kuzeybatı
uk: Північний, північно-західний
vi: Bắc-Tây Bắc

source: North by west
be: з Поўначы на Захад
bg: Северен от запад
el: Βόρειος με δυτικός
eu: Iparraldea mendebaldetik
gl: Norte desde o oeste
hr: Sjeverni-zapadni
lt: Šiaurės - Vakarų
lv: Uz ziemeļiem no rietumiem
pl: Z północy na zachód
si: බටහිර සිට උතුරට
sk: Severno západný
tr: Kuzey ile kuzey - kuzeybatı arası
uk: З північного на західний
vi: Bắc - Bắc-Tây Bắc

source: Variable
be: Пераменны
bg: Променлив
el: Μεταβλητός
eu: Aldakorra
gl: Variábel
hr: Promjenljiv
lt: Nepastovus
lv: Mainīgs
ms: Pembolehubah
pl: Zmienna
ro: Variabil
si: විචල්‍යය
sk: Premenlivé
tr: Değişken
uk: Мінливий
vi: Biến

source: Heavy
be: Тяжкі
bg: Силен
el: Ισχυρό
eu: Goibel
gl: Forte
hr: Jak
lt: Sunkus
lv: Smags
ms: Berat
pl: Ciężka
ro: Încărcată
si: අධික
sk: Husté
tr: Ağır
uk: Сильний
vi: Nặng

source: Light
be: Светлая
bg: Светло
el: Φωτεινό
eu: Argia
gl: Lixeira
hr: Svjetla
lt: Šviesi
lv: Viegls
ms: Ringan
pl: Światło
ro: Deschisă
si: මඳ
sk: Ľahký
tr: Açık
uk: Слабкий
vi: Sáng

source: from
be: із
bg: от
el: από
eu: nondik
gl: dende
hr: iz
lt: nuo
lv: no
ms: dari
pl: z
ro: de la
si: සිට
sk: zo
uk: з
vi: từ

source: at
be: з хуткасцю
bg: в
el: σε
eu: (e)n
gl: en
hr: pri
lt: apie
lv: pie
ms: pada
pl: przy
ro: la
si: හිදී
sk: na
uk: швидкість
vi: tại

source: n/a
be: н/д
bg: неизвестно
el: Μη διαθέσιμο
eu: e/e
gl: n/d
hr: nedostupno
lt: nežinoma
lv: nav pieejams
pl: b/d
ro: indisponibil
si: අදාල නැත
sk: nezistené
tr: mevcut değil
uk: н/д
vi: kxđ

source: millibar
be: мілібар
bg: милибара
el: χιλιοστά bar
eu: milibar
gl: milibares
lt: mBa
lv: milibāri
pl: milibar
si: මිලිබාර්
sk: milibarov
tr: milibar
uk: мілібар

source: inches of mercury
be: цаляў рт. сл.
bg: инча живачен стълб
el: Ίντσες στήλης Υδραργύρου
eu: merkurio hazbeteak
gl: polgadas de mercurio
hr: inča žive
lt: inHg
lv: colas dzīvsudraba staba
ms: inci mekuri
pl: cale słupa rtęci
ro: țoli coloană de mercur
si: රසදිය අගල්
sk: výška na teplomeri
tr: inçHg
uk: дюймів ртутного стовпчика
vi: Inch thủy ngân

source: millimeters of mercury
be: мм рт. сл.
bg: милиметра живачен стълб
el: Χιλιοστά στήλης Υδραργύρου
eu: milimetro merkurio
gl: milímetros de mercurio
hr: milimetra žive
lt: mmHg
lv: milimetri dzīvsudraba staba
ms: milimeter merkuri
pl: milimetry słupa rtęci
ro: milimetri coloană de mercur
si: රසදිය මිලිමීටර්
sk: milimetre na teplomeri
tr: mmHg
uk: міліметрів ртутного стовпчика
vi: Millimet thủy ngân

source: mi
be: мілі
bg: мл
el: μιλ
pl: km
ro: mile
uk: миль
vi: dặm

source: km
be: км
bg: км
el: χλμ
si: කිලෝ මිටර
uk: км
vi: cây số

source: in
be: у
bg: ин
el: ίντσες
gl: en
ms: dalam
pl: w
ro: țoli
si: තුල
sk: v
tr: İçinde
uk: дюймів
vi: inch

source: cm
be: см
bg: см
el: εκατοστά
si: සෙ.මි.

source: mm
be: мм
bg: мм
el: χιλιοστά
si: මි.මි.
uk: мм

source: Calm
be: Штыль
bg: Спокойно
el: Άπνοια
eu: Bare
gl: Calma
hr: Bez vjetra
lt: Ramu
lv: mierīgs
ms: Tenang
pl: Spokojny
si: සන්සුන්
sk: Bezvetrie
tr: Sakin
uk: Безвітряно
vi: Lặng gió

source: Light air
be: Ціхі
bg: Лек ветрец
el: Ήπιος αέρας
eu: Aire arina
gl: Aire suave
hr: Lagani zrak
lt: Ramus vėjas
lv: Viegls vējš
pl: Lekki powiew
ro: Aer uşor
si: සැහැල්ලු වාතය
sk: Vánok
tr: Hafif
uk: Легкий вітерець
vi: Gió rất nhẹ

source: Light breeze
be: Лёгкі
bg: Лек полъх
el: Ήπιο αεράκι
eu: Brisa arina
gl: Airexa suave
hr: Lagani povjetarac
lt: Lengvas vėjelis
lv: Viegla brīze
pl: Lekka bryza
ro: Briză uşoară
si: මද සුළඟ
sk: Slabý vietor
tr: Hafif esintili
uk: Легкий вітер
vi: Gió thổi nhẹ vừa phải

source: Gentle breeze
be: Слабы
bg: Нежен полъх
el: Ήπιο αεράκι
eu: Brisa leuna
gl: Airexa lixeira
hr: Nježni povjetarac
lt: Švelnus vėjelis
lv: Maiga brīze
pl: Słaby wiatr
ro: Briză blândă
si: සාමාන්‍ය සුළඟ
sk: Mierny vietor
tr: Hafif esintili
uk: Слабкий вітер
vi: Gió nhẹ nhàng

source: Moderate breeze
be: Умераны
bg: Умерен полъх
el: Μέτριο αεράκι
eu: Brisa moderatua
gl: Airexa moderada
hr: Umjereni povjetarac
lt: Vidutinis vėjelis
lv: Mērena brīze
pl: Umiarkowany wiatr
ro: Briză moderată
si: මධ්‍යම සුළඟ
sk: Dosť čerstvý vietor
tr: Orta esintili
uk: Помірний вітер
vi: Gió vừa phải

source: Fresh breeze
be: Свежы
bg: Свеж полъх
el: Δροσερό αεράκι
eu: Brisa freskoa
gl: Airexa fresca
hr: Osvježavajući povjetarac
lt: Gaivus vėjelis
lv: Svaiga brīze
pl: Świeża bryza
ro: Briză proaspătă
si: නැවුම් සුළඟ
sk: Čerstvý vietor
tr: Taze esintili
uk: Свіжий вітер
vi: Gió mạnh vừa phải

source: Strong breeze
be: Моцны
bg: Силен полъх
el: Δυνατό αεράκι
eu: Brisa indartsua
gl: Airexa forte
hr: Jaki povjetarac
lt: Stiprokas vėjelis
lv: Stipra brīze
pl: Silna bryza
ro: Briză puternică
si: තද සුළඟ
sk: Silný vietor
tr: Güçlü esintili
uk: Вітряно
vi: Gió mạnh

source: High wind
be: Моцны
bg: Силен вятър
el: Δυνατός άνεμος
eu: Haize erauntsia
gl: Ventos fortes
hr: Visoki vjetar
lt: Didelis vėjas
lv: Spēcīgs vējš
pl: Silny wiatr
ro: Vânt puternic
si: තද සුළං
sk: Prudký vietor
tr: Güçlü rüzgarlı
uk: Сильний вітер
vi: Gió mạnh

source: Gale
be: Вельмі моцны
bg: Вихрушка
el: Ανεμοθύελλα
eu: Haizete
gl: Vendaval
hr: Udari vjetra
lt: Stiprus vėjas
lv: Šalts
pl: Wichura
ro: Rafală
si: මාරුතය
sk: Víchrica
tr: Fırtınalı
uk: Дуже вітряно
vi: Gió mạnh hơn

source: Strong gale
be: Шторм
bg: Силна вихрушка
el: Σφοδρή Ανεμοθύελλα
eu: Haize-bolada indartsua
gl: Forte vendaval
hr: Jaki udari vjetra
lt: Labai stiprus vėjas
lv: Stipra šalts
pl: Silna wichura
ro: Rafale puternice
si: චණ්ඩ මාරුතය
sk: Silná víchrica
tr: Güçlü fırtınalı
uk: Шторм
vi: Gió rất mạnh

source: Violent storm
be: Люты шторм
bg: Силна буря
el: Βίαιη θύελλα
eu: Ekaitz bortitza
gl: Tormenta violenta
hr: Snažna oluja
lt: Smarki audra
lv: Viesuļvētra
pl: Gwałtowna burza
ro: Furtună violentă
si: විනාශකාරී කුණාටු
sk: Mohutná víchrica
tr: Şiddetli fırtınalı
uk: Сильний шторм
vi: Gió bão dữ dội

source: Evolution
be: Эвалюцыя
bg: Развитие
hr: Razvoj vremena
lt: Raida
lv: Diagramma
ms: Perkembangan
pl: Prognoza na kolejne dni
ro: Evolutie

source: Low drifting widespread dust
be: Пылны нанос
bg: Леко запрашен
gl: Amoreamentos extensos de po
hr: Zapusi prašine nošeni slabijim vjetrom
lt: Dulkių pūga
lv: Viegli izplatītas smilšu brāzmas
pl: Wietrzny kurz
ro: Praf purtat de vânt
si: මඳ දූවිලි සුළං
sk: Malé rozsiahle piesočné búrky
tr: Toz fırtınalı
uk: Вітер з пилом при землі
vi: Bão bụi nhỏ trên diện rộng

source: Snow blowing snow mist
be: Снег, завіруха, туман
bg: Снеговалеж с виелица и мъгла
eu: Elur laino haizetsua
gl: Neve con refachos de poalla de neve
hr: Snijeg praćen vjetrom i izmaglicom
lt: Pusto
lv: Sniegputenis ar sniega miglu
ms: Tiupan kabus salji
pl: Zamieć snieżna
si: හිම මීදුම්
sk: Občasné sneženie s hmlou
tr: Tipi
uk: Сніг заметіль туман
vi: Tuyết nhỏ kèm sương mù

source: Torrential rain shower
be: Праліўны дождж
bg: Проливен дъжд
eu: Uholde-euri zaparrada
gl: Choivas torrenciais
hr: Obilno jaki kišni pljuskovi
lt: Liūtis
lv: Straumēm plūstošs īslaicīgs lietus
ms: Hujan lebat
pl: Gwałtowny, przelotny deszcz
ro: Averse de ploaie torențială
si: වේගවත් වැසි
sk: Prívalový dážd
tr: Şiddetli yağmur geçişleri
uk: Проливний дощ
vi: Mưa xối xả

source: My-Weather-Indicator
hr: Moj indikator vremena
lt: Orų informacija
lv: Mans-Meteoroloģiskais-Indikātors
ms: Petunjuk Cuaca Saya
si: මාගේ-කාලගුණ-දර්ශකය
tr: Hava durumu göstergem
vi: Dự báo thời tiết
