Repository: Jalakas/my-weather-indicator
Catalog: po/*.po
Languages: be, bg, el, eu, gl, hr, lt, lv, ms, pl, ro, si, sk, tr, uk, vi

source: Feels like
be: Адчуваецца як
bg: Усеща се като
el: Αισθητή ως
eu: Sentsazio termikoa
gl: Sensación térmica
hr: Kao da je
lt: Jaučiama kaip
lv: Liekas ka
ms: Terasa seperti
pl: Temperatura odczuwalna
ro: Se simte ca
si: මෙන් හැඟේ
sk: Pocitová teplota
tr: Hissedilen
uk: Відчувається як
vi: Cảm thấy như

source: Dew Point
be: Кропка расы
bg: Температура на насищане
el: Σημείο δρόσου
eu: Ihintz puntua
gl: Punto de condensación
hr: Točka rošenja
lt: Rasos taškas
lv: Zemākā temperatūra
ms: Suhu mencair
pl: Punkt rosy
ro: Punct de rouă
si: තුෂාරාංකය
sk: Rosný bod
tr: Çiy noktası
uk: Точка роси
vi: Điểm sương

source: Wind
be: Вецер
bg: Вятър
el: Άνεμος
eu: Haizea
gl: Vento
hr: Vjetar
lt: Vėjas
lv: Vējš
ms: Angin
pl: Wiatr
ro: Vânt
si: සුළඟ
sk: Vietor
tr: Rüzgar
uk: Вітер
vi: Gió

source: Cloudiness
be: Пахмурнасць
bg: Облачност
el: Συννεφιά
eu: Lainotasuna
gl: Parte nubrada
hr: Oblačnost
lt: Debesuotumas
lv: Mākoņainums
ms: Keadaan mendung
pl: Zachmurzenie
ro: Nori
si: වලාකුළු බර
sk: Oblačno
tr: Bulutluluk
uk: Хмарність
vi: Mây mù

source: UV
be: Ультрафіялет
bg: Ултравиолетово излъчване
el: Υπεριώδης
lt: Ultravioletiniai spinduliai
pl: Promieniowanie ultrafioletowe
ro: Ultraviolete
si: අධෝරක්ත
uk: УФ
vi: Tia cực tím

source: Precipitation
be: Ападкі
bg: Ниво на валежите
el: Κατακρήμνιση
eu: Prezipitazioa
gl: Precipitación
hr: Oborine
lt: Krituliai
lv: Nokrišņi
pl: Opady
ro: Precipitații
si: වර්ෂා පතනය
sk: Zrážky
tr: Yağış
uk: Опади
vi: Lượng mưa

source: Dawn
be: Світанне
bg: Разсъмване
el: Αυγή
eu: Behera
gl: Primeiras luces
hr: Svitanje
lt: Švinta
lv: Ausma
ms: Subuh
pl: Świt
ro: Zori de zi
si: අලුයම
sk: Svitanie
tr: Şafak vakti
uk: Світанок
vi: Bình minh

source: Sunrise
be: Усход
bg: Изгрев
el: Ανατολή
eu: Egunsentia
gl: Abrente
hr: Izlazak sunca
lt: Saulėtekis
lv: Saullēkts
ms: Matahari Terbit
pl: Wschód słońca
ro: Răsărit
si: උදය
sk: Východ slnka
tr: Gündoğumu
uk: Схід сонця
vi: Mặt trời mọc

source: Sunset
be: Захад
bg: Залез
el: Δύση
eu: Ilunsentia
gl: Solpor
hr: Zalazak sunca
lt: Saulėlydis
lv: Saulriets
ms: Matahari Terbenam
pl: Zachód słońca
ro: Asfințit
si: ඉර බැසීම
sk: Západ slnka
tr: Günbatımı
uk: Захід сонця
vi: Mặt trời lặn

source: Dusk
be: Змярканне
bg: Здрачаване
el: Σούρουπο
eu: Ilun
gl: Escuridade total
hr: Sumrak
lt: Temsta
lv: Krēsla
ms: Senja
pl: Zmierzch
ro: Amurg
si: සවස
sk: Súmrak
tr: Alacakaranlık vakti
uk: Сутінки
vi: Hoàng hôn

source: Help
be: Даведка
bg: Помощ
el: Βοήθεια
eu: Laguntza
gl: Axuda
hr: Pomoć
lt: Pagalba
lv: Palīdzība
ms: Bantuan
pl: Pomoc
ro: Asistență
si: සහාය
sk: Pomoc
tr: Yardım
uk: Довідка
vi: Trợ giúp

source: Exit
be: Выхад
bg: Изход
el: Έξοδος
eu: Irten
gl: Saír
hr: Izlaz
lt: Išeiti
lv: Iziet
ms: Keluar
pl: Zakończ
ro: Ieșire
si: පිටවීම
sk: Ukončiť
tr: Çıkış
uk: Вихід
vi: Thoát

source: Conditions in
be: Надвор'е ў
bg: Прогноза за
el: Συνθήκες σε
eu: Baldintza
gl: Condicións en
hr: Vrijeme za
lt: Oro sąlygos:
lv: Apstākļi
ms: Keadaan di
pl: Warunki w
ro: Condițiile în
si: තත්වයන් තුල
sk: Podmienky v
tr: Şu konumdaki hava durumu:
uk: Погода в
vi: Điều kiện ở

source: Forecast for next hours
be: Прагноз на наступны гадзін
bg: Прогноза за следващите часове
el: Πρόγνωση για τις επόμενες ώρες
gl: Prognóstico das próximas horas
hr: Prognoza za sljedeće sate
lt: Prognozė artimiausiomis valandomis
lv: Prognoze nākamajām stundām
ms: Ramalan cuaca untuk beberapa jam kemudian
pl: Prognoza na kolejne godziny
ro: Previziuni pentru urmatoarele ore
sk: Predpoveď na daľšie hodiny
uk: Прогноз на наступні години
vi: Dự báo cho các giờ tiếp theo

source: Weather service
be: Служба надвор'я
bg: Услуга за синоптична прогноза
el: Μετεωρολογική Υπηρεσία
gl: Servizos meteorolóxicos
hr: Usluge vremena
lt: Orų tarnyba
lv: Meteoroloģiskais dienests
ms: Perkhidmatan ramalan cuaca
pl: Serwis pogodowy
ro: Serviciul meteo
sk: Servis počasia
uk: Синоптична служба
vi: Hệ thống thời tiết

source: A weather indicator
be: Індыкатар надвор'я
bg: Индикатор за синоптична прогноза
el: Δείκτης καιρού
eu: Eguraldiaren adierazle
gl: Un indicador do clima
hr: Indikator vremena
lt: Orų indikatorius bei prognozė
lv: Meteoroloģiskais indikators
ms: Petunjuk ramalan cuaca
pl: Powiadomienie o pogodzie
ro: Un indicator de vreme
si: කාලගුණ දර්ශකයකි
sk: Indikátor počasia
tr: Hava durumu gösterge uygulaması
uk: Індикатор погоди
vi: Một chỉ báo thời tiết

source: N/A
be: Н/Д
bg: Н/Д
el: Μη διαθέσιμο
eu: E/E
gl: N/D
hr: Nedostupno
lt: Nežinoma
lv: Nav pieejams
ms: Tidak tersedia
pl: B/D
ro: Indisponibil
si: අදාළ නොවේ
sk: Neznáme
tr: YOK
uk: Недоступно
vi: KXĐ

source: New Moon
be: Маладзік
bg: Новолуние
el: Νέα Σελήνη
eu: Ilberria
gl: Lúa nova
hr: Mlađak
lt: Jaunatis
lv: Jauns Mēness
ms: Bulan Baru
pl: Nów
ro: Lună nouă
si: නව සඳ
sk: Nov
tr: Yeni Ay
uk: Молодик
vi: Trăng mới

source: Waxing Crescent
be: Малады Месяц
bg: Нарастващ полумесец
el: Νέος Μηνίσκος
eu: Ilgora
gl: Lúa en abalo
hr: Rastući polumjesec
lt: Jaunatis (pilnėja)
lv: Augošs Mēness
ms: Bulan Sabit Membesar
pl: Dąży do pierwszej kwadry
ro: Semilună în creștere
si: පුරපක්ෂයේ අඩ සඳ
sk: Dorastajúci polmesiac
tr: Büyüyen Hilal
uk: Зростаючий півмісяць
vi: Trăng non

source: First Quarter
be: Першая чвэрць
bg: Първа четвърт
el: Πρώτο Τέταρτο
eu: Ilgora
gl: Cuarto en abalo
hr: Prva četvrt
lt: Priešpilnis
lv: Pirmais Ceturksnis
ms: Sukuan Pertama
pl: Pierwsza kwadra
ro: Primul pătrar
si: පළමු කාර්තුව
sk: Prvá štvrť
tr: İlk Dördün
uk: Перша чверть
vi: Trăng Thượng huyền

source: Waxing Gibbous
be: Малады Месяц
bg: Нарастваща луна
el: Νέος Αμφίκυρτος
eu: Ilgora
gl: Lúa en abalo convexa
hr: Rastuća svedenost
lt: Priešpilnis (pilnėja)
lv: Nepilns Mēness
ms: Hampir Purnama Membesar
pl: Dąży do pełni
ro: În creștere
si: පුරපක්ෂයේ සකුබු
sk: Dorastajúci mesiac
tr: Büyüyen Dışbükey
uk: Зростаючий опуклий місяць
vi: Trăng khuyết đầu tháng

source: Full Moon
be: Поўня
bg: Пълнолуние
el: Πανσέληνος
eu: Ilbetea
gl: Lúa chea
hr: Puni mjesec (uštap)
lt: Pilnatis
lv: Pilnmēness
ms: Bulan Penuh
pl: Pełnia
ro: Lună plină
si: පුර්ණ සඳ
sk: Spln
tr: Dolunay
uk: Повня
vi: Trăng tròn

source: Waning Gibbous
be: Убываючы Месяц
bg: Замъглена пълна луна
el: Παλιός Αμφίκυρτος
eu: Ilbehera
gl: Lúa en devalo convexa
hr: Opadajuća svedenost
lt: Pilnatis (dyla)
lv: Dilstošs Mēne
ms: Hampir Purnama Menyurut
pl: Dąży do ostatniej kwadry
ro: În scădere
si: අවපක්ෂයේ සකුබු
sk: Ubúdajúci mesiac
tr: Küçülen Dışbükey
uk: Спадаючий опуклий місяць
vi: Trăng khuyết cuối tháng

source: Last Quarter
be: Апошняя чвэрць
bg: Последна четвърт
el: Τελευταίο Τέταρτο
eu: Ilbehera
gl: Cuarto en devalo
hr: Zadnja četvrt
lt: Delčia
lv: Pēdējais Ceturksnis
ms: Sukuan Terakhir
pl: Ostatnia kwadra
ro: Ultimul pătrar
si: අවසන් කාර්තුව
sk: Posledná štvrť
tr: Son Dördün
uk: Остання чверть
vi: Trăng hạ huyền

source: Waning Crescent
be: Стары месяц
bg: Замъглен полумесец
el: Παλιός Μηνίσκος
eu: Ilgora
gl: Lúa en devalo
hr: Opadajući polumjesec
lt: Delčia (dyla)
lv: Dilstošs Mēness
ms: Bulan Sabit Menyurut
pl: Dąży do nowiu
ro: Semilună în scădere
si: අවපක්ෂයේ හඳ
sk: Ubúdajúci polmesiac
tr: Küçülen Hilal
uk: Спадаючий півмісяць
vi: Trăng tàn

source: Day of week
be: Дзень тыдня
bg: Ден от седмицата
el: Μέρα της εβδομάδας
eu: Asteko eguna
gl: Día da semana
hr: Dan u tjednu
lt: Savaitės diena
lv: Nedēļas diena
ms: Hari mingguan
pl: Dzień tygodnia
ro: Ziua din saptămână
si: සතියේ දවස
sk: Deň v týždni
tr: Gün
uk: День тижня
vi: Ngày trong tuần

source: Moon Phase
be: Фаза Месяца
bg: Фаза на луната
el: Σεληνιακή φάση
eu: Ilargi fasea
gl: Fase lunar
hr: Mjesečeve mijene
lt: Mėnulio fazė
lv: Mēness fāze
ms: Fasa Bulan
pl: Faza księżyca
ro: Fazele lunii
si: චන්ද්‍ර කලාප
sk: Fáza mesiaca
tr: Ay'ın fazı
uk: Фаза місяця
vi: Pha Mặt Trăng

source: Condition
be: Умовы надвор'я
bg: Условия
el: Καιρικές συνθήκες
eu: Baldintza
gl: Condición
hr: Stanje
lt: Sąlygos
lv: Nosacījumi
ms: Keadaan
pl: Warunek
ro: Condiție
si: තත්වය
sk: Stav
tr: Durum
uk: Погодні умови
vi: Điều kiện

source: High temperature
be: Максімальная тэмпература
bg: Максимална температура
el: Μέγιστη θερμοκρασία
eu: Tenperatura altua
gl: Temperatura máxima
hr: Najviša temperatura
lt: Aukščiausia temperatūra
lv: Augstākā temperatūra
ms: Suhu tinggi
pl: Wysoka temperatura
ro: Temperaturi ridicate
si: ඉහල උෂ්ණත්වය
sk: Najvyššia teplota
tr: Yüksek sıcaklık
uk: Максимальна температура
vi: Nhiệt độ cao nhất

source: Low temperature
be: Мінімальная тэмпература
bg: Минимална температура
el: Ελάχιστη θερμοκρασία
eu: Tenperatura baxua
gl: Temperatura mínima
hr: Najniža temperatura
lt: Žemiausia temperatūra
lv: Zemākā temperatūra
ms: Suhu rendah
pl: Niska temperatura
ro: Temperaturi scăzute
si: පහල උෂ්ණත්වය
sk: Najnižšia teplota
tr: Düşük sıcaklık
uk: Мінімальна температура
vi: Nhiệt độ thấp nhất

source: Maximum wind
be: Максімальная хуткасць ветру
bg: Максимална скорост на вятъра
el: Μέγιστη ένταση ανέμου
eu: Gehienezko haizea
gl: Vento máximo
hr: Maksimalan vjetar
lt: Didžiausias vėjo greitis
lv: Maksimālais vējš
ms: Kelajuan angin maksimum
pl: Maksymalny wiatr
ro: Viteza maximă a vântului
si: උපරිම සුළඟ
sk: Maximálna rýchlosť vetra
tr: En fazla rüzgar hızı
uk: Макс. швидкість вітру
vi: Tốc độ gió cực đại

source: Average wind
be: Сярэдняя хуткасць ветру
bg: Средна скорост на вятъра
el: Μέση ένταση ανέμου
eu: Bataz besteko haizea
gl: Vento medio
hr: Prosječan vjetar
lt: Vidutinis vėjas
lv: Vidējais vējš
ms: Kelajuan angin sederhana
pl: Średni wiatr
ro: Viteza medie a vântului
si: මධ්‍යම සුළඟ
sk: Priemerná rýchlosť vetra
tr: Ortalama rüzgar hızı
uk: Серед. швидкість вітру
vi: Tốc độ gió trung bình

source: Maximum humidity
be: Максімальная вільготнасць
bg: Максимална влажност
el: Μέγιστη υγρασία
eu: Gehiemezko hezetasuna
gl: Humidade máxima
hr: Maksimalna vlažnost
lt: Didžiausias drėgnumas
lv: Maksimālais mitrums
ms: Kelembapan maksimum
pl: Maksymalna wilgotność
ro: Umiditate maximă
si: උපරිම ආර්ද්‍රතාවය
sk: Maximálna vlhkosť
tr: En fazla nem değeri
uk: Макс. вологість
vi: Độ ẩm cực đại

source: Minumum humidity
be: Мінімальная вільготнасць
bg: Минимална влажност
el: Ελάχιστη υγρασία
eu: Gutxieneko hezetasuna
gl: Humidade mínima
hr: Minimalna vlažnost
lt: Vidutinis drėgnumas
lv: Minimālais mitrums
ms: Kelembapan minimum
pl: Minimalna wilgotność
ro: Umiditate minimă
si: අඩුම ආර්ද්‍රතාවය
sk: Minimálna vlhkosť
tr: En az nem değeri
uk: Мінімальна вологість
vi: Độ ẩm nhỏ nhất

source: Rain measurement
be: Колькасць ападкаў
bg: Ниво на валеж
el: Στάθμη βροχόπτωσης
eu: Euri neurketa
gl: Precipitación
hr: Količina kišnih padalina
lt: Kritulių kiekis
lv: Lietus mērījumi
ms: Tolok hujan
pl: Opad deszczu
ro: Indicatori pentru ploaie
si: වැසි දර්ශකය
sk: Predpovedané zrážky
tr: Yağmur ölçümü
uk: Опади
vi: Lượng mưa

source: Snow measurement
be: Колькасць ападкаў
bg: Ниво на снеговалеж
el: Εμφάνιση στάθμης
eu: Elur neurketa
gl: Medida da neve
hr: Količina snježnih padalina
lt: Kritulių kiekis
lv: Sniega mērījumi
ms: Tolok salji
pl: Opad śniegu
ro: Arata valorile
si: හිම දර්ශකය
sk: Predpovedané sneženie
tr: Kar ölçümü
uk: Опади снігу
vi: Lượng tuyết

source: Average humidity
be: Адносная вільготнасць
bg: Променлива влажност
el: Μέση υγρασία
eu: Bataz besteko hezetasuna
gl: Humidade media
hr: Prosječna vlažnost
lt: Vidutinė drėgmė
lv: Vidējais mitrums
ms: Kelembapan sederhana
pl: Średnia wilgotność
ro: Umiditate medie
si: මධ්‍යම ආර්ද්‍රතාවය
sk: Priemerná vlhkosť
tr: Ortalama nem
uk: Середня вологість
vi: Độ ẩm trung bình

source: Blowing sand
be: Пясчаная бура
bg: Пясък със силен вятър и намалена видимост
el: Εκτεταμένη άμμος λόγω ανέμου
eu: Harea-bisuts
gl: Refachos de area
hr: Pijesak praćen vjetrom
lt: Smėlio audra
lv: Smilšu vētra
ms: Pasir ditiup angin
pl: Burza piaskowa
ro: Vânt cu nisip
si: වැලි කුණාටු
sk: Piesočný vietor
tr: Kum fırtınası
uk: Піщана буря
vi: Gió cát

source: Blizzard
be: Мяцель
bg: Виелица
el: Χιονοθύελλα
eu: Bisutsa
gl: Cifra
hr: Snježna mećava
lt: Pūga
lv: Sniegputenis
ms: Ribut Salji
pl: Zamieć
ro: Viscol
si: හිම කුණාටුව
sk: Snehová búrka
tr: Şiddetli kar fırtınası
uk: Хуртовина
vi: Bão tuyết

source: Blowing snow
be: Замець
bg: Снежна виелица
el: Χιονοθύελλα
eu: Elur-bisutsa
gl: Xistra
hr: Snježni zapusi
lt: Pustomas sniegas
lv: Sniegputenis
ms: Salji menderu
pl: Zamieć śnieżna
ro: Zăpadă viscolită
si: හිම කුණාටු
sk: Rozsiahly snežný vietor
tr: Tipi
uk: Заметіль
vi: Gió tuyết

source: Blowing widespread dust
be: Пылны нанос
bg: Прашни вихрушки
el: Εκτεταμένη σκόνη λόγω ανέμου
gl: Refachos extensos de po
hr: Rasprostranjeni zapusi prašine
lt: Dulkių audra
lv: Smilšu vētra
ms: Tiupan debu
pl: Burza pyłowa
ro: Vant cu praf imprastiat in aer
si: පැතිරුණු දූවිලි කුණාටු
sk: Rozsiahly prašný vietor
tr: Toz fırtınası
uk: Вітер з пилом
vi: Có bụi trên diện rộng

source: Chance of a thunderstorm
be: Магчыма навальніца
bg: Вероятност за гръмотевична буря
el: Πιθανή καταιγίδα με κεραυνούς
eu: Trumoi-ekaitz aukera
gl: Posibilidade de tormenta eléctrica
hr: Moguće grmljavinsko nevrijeme
lt: Žaibavimo tikimybė
lv: Iespējams pērkona negaiss
ms: Keberangkalian ribut petir
pl: Możliwa burza z piorunami
ro: Șanse de descărcări electrice
si: අකුණු කුණාටු හැකියාව
sk: Občasné hromobitie
tr: Gökgürültülü sağanak yağışlı
uk: Імовірність грози
vi: Khả năng có bão

source: Chance of flurries
be: Магчыма слабы снег
bg: Предимно слънчево
el: Πιθανότητα ελαφριάς χιονόπτωσης
eu: Haize erauntsi aukera
gl: Posibilidade de folerpas
hr: Mogući nalet vjetra
lt: Galimas snygis
lv: Iespējamas brāzmas
ms: Berkemungkinan larian hujan
pl: Możliwe opady
ro: Șanse de fulguială
si: ලුහු වැසි හැකියාව
sk: Občasná prietrž mračien
tr: Hafif karlı
uk: Можливі пориви вітру
vi: Có gió lớn

source: Chance of rain
be: Магчыма дождж
bg: Вероятност за дъжд
el: Πιθανή βροχόπτωση
eu: Euri aukera
gl: Posibilidade de choiva
hr: Moguća kiša
lt: Galimas lietus
lv: Iespējams lietus
ms: Keberangkalian hujan
pl: Możliwy deszcz
ro: Șanse de ploaie
si: වැසි හැකියාව
sk: Občasný dážď
tr: Yağmurlu
uk: Можливий дощ
vi: Có khả năng mưa

source: Chance of showers
be: Магчыма праліўны дождж
bg: Вероятност за порои
el: Πιθανή μπόρα
eu: Zaparrada aukera
gl: Posibilidade de chuvascos
hr: Mogući pljuskovi
lt: Galimos liūtys
lv: Iespējams īslaicīgs lietus
ms: Keberangkalian hujan panas
pl: Możliwe ulewy
ro: Șanse de averse
si: වැසි හැකියාව
sk: Občasné prehánky
tr: Sağanak yağışlı
uk: Можливі зливи
vi: Có khả năng mưa rào

source: Chance of snow
be: Магчыма снег
bg: Вероятност за снеговалеж
el: Πιθανή χιονόπτωση
eu: Elur aukera
gl: Posibilidade de neve
hr: Mogući snijeg
lt: Galimas sniegas
lv: Iespējams sniegs
ms: Keberangkalian salji turun
pl: Możliwe opady śniegu
ro: Șanse de ninsoare
si: හිම හැකියාව
sk: Občasné sneženie
tr: Karlı
uk: Можливий сніг
vi: Có khả năng tuyết rơi

source: Chance of storm
be: Магчыма шторм
bg: Вероятност за буря
el: Πιθανή θύελλα
eu: Ekaitz aukera
gl: Posibilidade de tormenta
hr: Moguća oluja
lt: Galima audra
lv: Iespējama vētra
ms: Keberangkalian ribut
pl: Możliwa burza
ro: Şanse de furtună
si: සුළං කුණාටු හැකියාව
sk: Občasné búrky
tr: Fırtınalı
uk: Можлива буря
vi: Có khả năng bão

source: Chance of thunderstorms
be: Магчымы навальніцы
bg: Вероятност за гръмотевични бури
el: Πιθανή καταιγίδα με κεραυνούς
eu: Trumoi-ekaitzen aukera
gl: Posibilidade de tronos
hr: Moguće grmljavinske oluje
lt: Galima perkūnija
lv: Iespējams pērkona negaiss
ms: Keberangkalian ribut petir
pl: Możliwe burze z piorunami
ro: Șanse de furtuni cu descărcări electrice
si: අකුණු කුණාටු හැකියාව
sk: Občasné hromobitia
tr: Gökgürültülü fırtınalı
uk: Можливі грози
vi: Có khả năng dông

source: Chance of tstorm
be: Магчымы дажджы з навальніцамі
bg: Вероятност за гръмотевична буря
el: Πιθανή καταιγίδα με κεραυνούς
eu: Ekaitza arriskua
gl: Posibilidade de tempestade
hr: Moguća grmljavinska oluja
lt: Galima audra
lv: Iespējams negaiss
ms: Keberangkalian ribut petir
pl: Możliwe burze z piorunami
ro: Şanse de furtună
si: අකුණු කුණාටු හැකියාව
sk: Občasná blýskavica
tr: Gökgürültülü fırtınalı
uk: Можливі дощі з грозами
vi: Có khả năng dông

source: Clear
be: Ясна
bg: Ясно
el: Αίθριος
eu: Garbitu
gl: Claro
hr: Vedro
lt: Giedra
lv: Skaidrs
ms: Cerah
pl: Bezchmurnie
ro: Senin
si: මකන්න
sk: Jasno
tr: Açık
uk: Ясно
vi: Trong sáng

source: Cloudy
be: Воблачна
bg: Облачно
el: Νεφελώδης
eu: Lainotua
gl: Nubrado
hr: Oblačno
lt: Debesuota
lv: Apmācies
ms: Berawan
pl: Zachmurzenie
ro: Înnorat
si: වලාකුළු සහිත
sk: Oblačno
tr: Bulutlu
uk: Хмарно
vi: Đầy mây

source: Cold
be: Холадна
bg: Студено
el: Ψυχρός
eu: Hotz
gl: Frío
hr: Hladno
lt: Šaltis
lv: Auksts
ms: Dingin
pl: Zimno
ro: Rece
si: සීතල
sk: Chladno
tr: Soğuk
uk: Прохолодно
vi: Lạnh

source: Drizzle
be: Невялікі дождж
bg: Ръмене
el: Ψιλόβροχο
eu: Zirimiria
gl: Orballo
hr: Rominjanje
lt: Dulksna
lv: Smidzina
ms: Gerimis
pl: Mżawka
ro: Burniță
si: වැහි පොද
sk: Mrholenie
tr: Yağmur çiselemesi
uk: Мряка
vi: Mưa phùn

source: Drizzle rain
be: Імглівы дождж
bg: Дъжд и поледица
el: Ψιλόβροχο
eu: Sirimiri
gl: Orballo
hr: Sitna kiša
lt: Smulkus lietus
lv: Smidzina lietus
ms: Hujan gerimis
pl: Mżawka
ro: Burniță
si: පොද වැස්ස
sk: Mrholenie
tr: Yağmur çiselemesi
uk: Дрібний дощ
vi: Mưa bụi

source: Dust whirls
be: Пылныя віхры
bg: Прашна буря
el: Στρόβιλοι σκόνης
eu: Hauts-zurrunbiloak
gl: Remuíños de po
hr: Vrtlozi prašine
lt: Dulkių sūkuriai
lv: Putekļu virpuļi
ms: Pusaran debu
pl: Trąba powietrzna
ro: Vârtejuri de praf
si: දුවිලි සුළි
sk: Piesočné víry
tr: Toz fırtınalı
uk: Пилові вихори
vi: Làn bụi cuốn

source: Dust
be: Пыльна
bg: Прашно
el: Σκόνη
eu: Hautsa
gl: Po
hr: Prašina
lt: Dulkės
lv: Putekļi
ms: Debu
pl: Tumany kurzu
ro: Praf
si: දූවිල්ල
sk: Prašno
tr: Tozlu
uk: Пил
vi: Bụi

source: Extreme rain
be: Праліўны дождж
bg: Екстремен дъжд
el: Ακραία βροχόπτωση
eu: Euri jasa
gl: Choiva extrema
hr: Jaka kiša
lt: Labai stiprus lietus
lv: Lietusgāzes
ms: Hujan lebat
pl: Ulewny deszcz
ro: Ploaie torențială
si: ධාරානිපාත වර්ෂා
sk: Silný dážď
tr: Aşırı yağmurlu
uk: Сильний дощ
vi: Mưa nặng hạt

source: Fair
be: Ясна
bg: Предимно безоблачно
el: Μέτριος
eu: Ona
gl: Bo
hr: Vedro
lt: Gražus oras
lv: Mērens
ms: Sederhana
pl: Umiarkowanie
ro: Vreme bună
si: සාමාන්‍ය
sk: Pekné
tr: Açık
uk: Ясно
vi: Thời tiết đẹp

source: Flurries
be: Парывісты вецер
bg: Кратки превалявания
el: Σύντομες χιονοπτώσεις
eu: Haizealdiak
gl: Folerpas
hr: Naleti vjetra
lt: Sniegas
lv: Brāzmas
pl: Prószenie śniegu
ro: Fulguieli
si: ලුහු වැසි
sk: Prehánky
tr: Hafif karlı
uk: Легкий сніг
vi: Mưa dông bất chợt

source: Fog patches
be: Месцамі туман
bg: Частична мъгла
el: Κατά τόπους ομίχλη
eu: Laino-unadak
gl: Bancos de néboas
hr: Mjestimično maglovito
lt: Vietomis rūkas
lv: Miglas vāli
ms: Tompokan kabus
pl: Lokalne mgły
ro: Pâlcuri de ceață
si: මීදුම් සේයා
sk: Miestami hmly
tr: Sisli
uk: Місцями туман
vi: Có sương mù

source: Fog
be: Туман
bg: Мъгла
el: Ομίχλη
eu: Lainoa
gl: Néboa
hr: Magla
lt: Rūkas
lv: Migla
ms: Kabus
pl: Mgła
ro: Ceață
si: මීදුම
sk: Hmla
tr: Sisli
uk: Туман
vi: Sương mù

source: Foggy
be: Туман
bg: Мъгливо
el: Ομιχλώδης
eu: Lainotsua
gl: Con brétema
hr: Maglovito
lt: Ūkanota
lv: Miglains
ms: Berkabus
pl: Mgliście
ro: Ceață
si: මීදුම් සහිත
sk: Hmlisto
tr: Sisli
uk: Туманно
vi: Sương mù

source: Freezing drizzle
be: Намаразь
bg: Слана
el: Χιονόνερο
eu: Zirimiri izoztua
gl: Chuvisca xeada
hr: Ledeno rominjanje
lt: Lijundra
lv: Smalks lietus, kas piesalst
ms: Gerimis sejuk beku
pl: Zamarzająca mżawka
ro: Burniță rece
si: හිමායන වැසි පොද
sk: Mrznúce mrholenie
tr: Kırağı
uk: Паморозь
vi: Mưa phùn lạnh

source: Freezing fog
be: Марозны туман
bg: Скреж
el: Παγωμένη ομίχλη
eu: Laino izoztua
gl: Néboa con xeo
hr: Ledena magla
lt: Šaltas rūkas
lv: Saldējoša migla
ms: Kabus sejuk dingin
pl: Marznąca mgła
ro: Ceață care îngheață
si: හිමායන මීදුම
sk: Mrznúce hmly
tr: Dondurucu sisli
uk: Туман з інеєм
vi: Sương mù kèm gió buốt

source: Freezing rain
be: Ледзяны дождж
bg: Леден дъжд
el: Χιονόνερο
eu: Euri izoztua
gl: Choiva xeada
hr: Ledena kiša
lt: Lijundra
lv: Saldējošs lietus
ms: Hujan dingin
pl: Zamarzający deszcz
ro: Ploaie foarte rece
si: හිමායන වැස්ස
sk: Mrznúci dážď
tr: Dolu yağışlı
uk: Дощ з мокрим снігом
vi: Mưa rét

source: Funnel cloud
be: Смерч
bg: Фуниевиден облак
el: Στρόβιλος
eu: Tragarroi-hodeia
gl: Nube de funil
hr: Dimni oblak
lt: Lietingi debesys
lv: Piltuvveida mākoņi
ms: Awan puting beliung
pl: Trąba powietrzna
ro: Nor de tornadă
si: පුනීල වලාකුළු
sk: Nárazový vietor
tr: Bulutlu
uk: Смерч
vi: Mây ống

source: Hail showers
be: Месцамі град
bg: Дъжд и град
el: Βροχές με χαλάζι
eu: Kazkabar-zaparradak
gl: Fortes precipitacións de pedrazo
hr: Pljusak s tučom
lt: Kruša
lv: Krusa un īslaicīgs lietus
ms: Hujan batu
pl: Krótkotrwały grad
ro: Averse de grindină
si: හිම වර්ෂා
sk: Krupobitie
tr: Yoğun dolu yağışlı
uk: Дощ з градом
vi: Mưa đá

source: Hail
be: Град
bg: Градушка
el: Χαλάζι
eu: Txingorra
gl: Sarabia
hr: Tuča
lt: Kruša
lv: Krusa
ms: Hujan batu
pl: Grad
ro: Grindină
si: හිම කැට වැස්ස
sk: Krupobitie
tr: Dolu
uk: Град
vi: Mưa đá

source: Haze
be: Невялікі туман
bg: Лека мъгла
el: Καταχνιά
eu: Lanbroa
gl: Brétema
hr: Izmaglica
lt: Nedidelis rūkas
lv: Dūmaka
ms: Jerebu
pl: Zamglenia
ro: Ceață fină
si: හීන් මීදුම
sk: Opar
tr: Puslu
uk: Імла
vi: Khói mù

source: Heavy freezing drizzle
be: Моцная намаразь
bg: Силно заледяване
el: Ισχυρό χιονόβροχο
eu: Sirimiri hotz astuna
gl: Orballo xeado forte
hr: Jaka smrznuta rosulja
lt: Smarki lijundra
lv: Spēcīgs piesalstošs smalks lietus
pl: Silna, marznąca mżawka
ro: Lapoviță
si: අධික හිමායන හිරි පොද
sk: Silne mrznúce mrholenie
tr: Ağır buzlu çiseleme
uk: Сильна паморозь
vi: Mưa lạnh nặng hạt

source: Heavy intensity drizzle
be: Моцная імгла
bg: Много силна поледица
el: Έντονο ψιχάλισμα
eu: Intentsitate handiko zirimiria
gl: Orballo intenso
hr: Jaka rosulja
lt: Intensyvi dulksna
lv: Ļoti intensīvi smidzina
ms: Gerimis sejuk beku
pl: Bardzo intensywna mżawka
ro: Burniță intensă
si: අධික වේගවත් හිරි පොද
sk: Silné mrholenie
tr: Yoğun çiseleme
uk: Сильна мряка
vi: Mưa to

source: Heavy intensity drizzle rain
be: Моцная імжа
bg: Много силна поледица с дъжд
el: Έντονο ψιλόβροχο
eu: Intentsitate handiko zirimiria
gl: Chuviñada intensa
hr: Obilnija sitna kišica
lt: Intensyvus smulkus lietus
lv: Ļoti intensīvs smidzinošs lietus
ms: Hujan gerimis sejuk beku
pl: Bardzo intensywna mżawka
ro: Burniță abundentă
si: අධික වේගවත් හිරි පොද වැස්ස
sk: Husté mrholenie
tr: Ypüğun çisenti yağmur
uk: Затяжні дощі
vi: Mưa rất to

source: Heavy intensity rain
be: Моцны дождж
bg: Проливен дъжд
el: Έντονη βροχόπτωση
eu: Euri-zaparrada
gl: Choiva intensa
hr: Obilna kiša
lt: Intensyvus lietus
lv: Ļoti intensīvs lietus
ms: Hujan kuat
pl: Ciężki intensywny deszcz
ro: Ploaie torențială
si: අධික වේගවත් වැස්ස
sk: Hustý dážď
tr: Yoğun yağmur
uk: Сильний дощ
vi: Mưa dày

source: Heavy intensity shower rain
be: Моцны лівень
bg: Интензивен проливен дъжд
el: Έντονη καταιγίδα
eu: Euri-zaparrada
gl: Precipitacións de choiva intensas
hr: Obilniji pljusak
lt: Smarki liūtis
lv: Ļoti intensīvs īslaicīgs lietus
ms: Hujan kuat
pl: Bardzo intensywny deszcz
ro: Averse abundente
si: වේගවත් ධාරානිපාත වැස්ස
sk: Silný lejak
tr: Yoğun sağanak
uk: Потужні зливи
vi: Mưa tuyết dày đặc

source: Heavy rain at times
be: Часамі ліўні
bg: Краткотраен проливен дъжд
el: Σποραδικές καταιγίδες
eu: Euri-zaparradak tarteka
gl: Choiva forte intermitente
hr: Povremeno obilnija kiša
lt: Kartais smarkus lietus
lv: Reizēm stiprs lietus
ms: Hujan lebat di kala
pl: Przelotny ulewny deszcz
ro: Ploi torențiale sporadice
si: කඩින් කඩ තද වැසි
sk: Niekedy hustý dážď
tr: Aralıklı yoğun yağmur
uk: Місцями зливи
vi: Mưa lớn

source: Heavy rain
be: Моцны дождж
bg: Проливен дъжд
el: Δυνατή βροχή
eu: Euri-zaparrada
gl: Choiva forte
hr: Jaka kiša
lt: Smarkus lietus
lv: Stiprs lietus
ms: Hujan lebat
pl: Silny deszcz
ro: Ploaie abundentă
si: තද වැස්ස
sk: Hustý dážď
tr: Ağır yağmur
uk: Сильний дощ
vi: Mưa to
